Руководство пользователя и Amarok;
Майк Дил
madpenguin8 @ Yahoo. ком
Команда разработчиков Amarok
Разработчиков
(C) 2005 Mandriva офис по Mandriva. ан польского перевода Павел Dabek pdabek @ разовые. ан пересмотра и обновления польского перевода Marcin Коцур marcinkocur @ Op. ан Польский Перевод Майкл Bendowski Bendowski @ gmail.com. ком Обновление до 1. 4
Команда разработчиков Amarok
Команда doKymotion
И Amarok; является мультимедийный проигрыватель для KDE.
KDE
Средства массовой информации
игрок
аудио
OGG
mp3
WAV
музыка
звук
сценарий
Введение
Логотип
И Amarok; это аудио плеер для & KDE;. Эта программа не только обладает огромным потенциалом, но также легко использовать.
W & Amarok; Вы можете просто перетащить музыку в плейлист, а не копаться в бесконечных меню. Глядя на один конкретной песни в огромной коллекции? Коллекция Browser и Amarok; оснащен быстрой панели поиска поможет вам найти за считанные секунды.
Может показаться, что и Amarok; имеет те же старые функции, как любой средний аудио-плеер, но мы пошли дальше. Один взгляд на браузере konktekstową рассказать вам, почему и Amarok; другие игроки остались позади. Контекстный браузер показывает все виды информации, связанной с текущей воспроизводимой дорожки - от обложки альбома от других работ того же автора, до момента, когда других подрядчиков - не интересный способ узнать о вашей коллекции!
У вас есть несколько плейлистов и не знаю, какой выбрать? Это означает, что плейлистов браузера является правильным для Вас. Вы никогда не можете решить, какую музыку вы выбрали? Динамический режим набирает для вас музыку, и умный список возьмет Вас к соответствующей части тонкой коллекции.
Amarok фантастическую поддержку iPod- и яблоко, Iriver IFP и целая куча типичных устройств USB. Он также поддерживает различные звуковые серверов, так что вы можете выбрать, как вы слушаете музыку. Эти и другие особенности делают его самым передовым существующих игрок. И Amarok; это умная, она сексуальна и мудр. Мы надеемся, что его использование позволит вам по-настоящему "заново музыку!"
Авторские права и лицензия
Программа Copyright & копия; 2003- 2004 Марк Kretschmann Марки @ Web. Команда-де-и Amarok.
Команда AmaroK
Кристиан facet- магнит Крис @ Крис Muehlhaeuser. де
Фредерика Ich бен Kein Deustcher! Holljen FH @ EZ. хорошо
Марк хорошо, но не замечательный Kretschmann Марки @ Web. де
Turtle- Power Max Howell макс. Хауэлл @ methylblue. ком
Майк фиолетовый не только для девочек! Диль madpenguin8 @ Yahoo. ком
PIERPAOLO Ди Panfilo programista- растяпа pippo_ DP @ либеро. это
Роман, и сказал Бог: да будет Mac Becker Роман @ formmorf. де
Вниз SEB Surfin 'под Руис меня @ sebruiz. чистый
Станислав, если кто-то сказал DCOP? Станислав Karchebny. Karchebny @ kdemail. чистый
Сотрудничество:
Адам Pigg (анализаторы, поправки) Адам @ piggz. fsnet. CO. Великобритания
Adeodato Симо (патч) asp16 @ алу. UA. ES
Александр Оливейра (улучшения, отладка) aleprj @ gmail.com. ком
Андреас Маир (услуга MySQL) AM_ мл @ linogate. ком
Андрей Де Квинси (услуга PostgreSQL) adq_ DVB @ lidskialf. чистый
Кристи Харрис (roKymoter) болтаться. ребенок @ gmail.com. ком
Turthra Leinir Дэн Дженсен (помощник первого запуска) Администратор @ removeleinir. DK
Дэн Мельцер (roKymoter) водород @ notyetimplemented. ком
Энрико Рос (анализаторы, OpenGL) эрос. KDE @ электронной почте. это
Флориана "поток данных" Egerer (значок Amarok 'Blue Wolf) flo_ for_ никогда @ GMX. на
Жерар Dürrmeyer (иконки и развивающиеся фото) Жерар @ randomtree. ком
Грег Мейер (неоценимую помощь в лавине ошибок в версиях до 1. 2) Грег @ gkmweb. ком
Харальд Ситтера (roKymoter, переводы, исправления, скриншоты) Харальд. @ Kdemail няня. чистый
Ян Монро (патчи, шаблоны, скрипты Ruby (eean)) Ян @ Монро. ню
Яркко Lehti (тестер) зиними @ ики. фантастические
Jocke Андерссон (roKymoter) ajocke @ gmail.com. ком
Уэсли Кеннет Вимер II (иконки) kwwii @ загрузочной заставки. организация
Кенни Лемье (создатель Amarok) стружки @ ПМОН. чистый
Мельхиор Франц (новая процедура FFT, отладка) mfranz @ KDE. организация
Майкл Пайн (K3B экспорт кода) Майкл. Пайн @ kdemail. чистый
Ненад Grujicic (виньетка Программа 1. 1) mchitman @ Neobee. чистый
Оливье Bedard (веб-сайт хостинг) палео @ ПМОН. чистый
Reigo Reinmets (поддержка Википедия, патчи) xatax @ жарко. EE
Roland Gigler (двигатель MAS) Майкл. Пайн @ kdemail. чистый
Сами Ниеминен (поддержка Audioscrobbler) в одиночку. Ниеминен @ ики. фантастические
Скотт Вилер (TagLib) Уилер @ KDE. организация
Стефан Bogner (связка материала) Bochi @ онлайн. мисс
Стефан Сигель (изменения, отладка) KDE @ SDAS. де
Свен Krohlas (roKymoter) Свен @ асбестовых онлайн. де
Whitehawk Stormchaser (тесты, исправления) zerokode @ GMX. чистый
Документация Copyright & копия; 2004 Майк Дил madpenguin8 @ Yahoo. ком
И UnderFDL; И UnderGPL;
Установка
Как получить и Amarok;
И Amarok; можно скачать здесь, или на домашней странице программы
Последнюю версию можно найти в разделе SVN и KDE;: / багажник / extragear / мультимедиа / Amarok /.
Как составить и Amarok;
Если вы хотите, чтобы скомпилировать и установить Amarok на вашей системе, введите следующую команду в корневом каталоге дистрибутива Amarok:
, / Настройка - префикс = `KDE-конфигурации - prefix` сделать Су - С" делают установить "
не Command - включить финала флаг настроить, больше не поддерживается.
Так и Amarok; использует Autoconf и Automake вы должны иметь никаких проблем. Если у вас возникли проблемы, пожалуйста, сообщите о них в список рассылки и KDE;.
Параметры конфигурации
При составлении и Amarok, как и в случае с другими программами, вы можете включить или отключить определенные параметры. Вот список вариантов, которые могут быть сконфигурированы:
Во время компиляции, некоторые из вариантов требуют использования определенных зависимостей. См раздел нуждается, чтобы получить подробную информацию.
Опция
По умолчанию
Описание
- Enable-отладки =
не
Включает отладочные символы. У вас есть выбор, да, нет, да и полно. Выберите полном объеме, если вы намерены поддерживать развитие и Amarok;.
- Enable-MySQL
Инвалид
Включает базы данных MySQL в & Amarok;
- Disable- Amazon
Включено
Отключение коллекцию чехлов из Амазонки и Amarok;
- Без-искусства
От
Отключение Искусство поддержку и Amarok;
- Без-GStreamer
Отключает поддержку GStreamer для & Amarok;
- Без спирали
Позволяет Helix двигатель & Amarok;
- Без-Xine
Отключает поддержку Xine для & Amarok;
- Без НММ
Без
Позволяет НММ в & Amarok;
- без массы
Позволяет MAS в & Amarok;
- Без-OpenGL
Отключение поддержки OpenGL (анализатор) в & Amarok;
- Без-SQLite included-
Не используйте прилагаемый источник SQLite (требуется установка SQLite)
суслик
И Лаури. Вт; И Лаури. Вт. почта;
С суслика начали использовать для распространения информации на территории кампуса университета Миннесоты. Это позволяет пользователю получить доступ через Интернет к информации, собранной Gopher-сервере.
Gopher Интернет является информационная служба на основе выпадающего меню интерфейса. Люди выбора пунктов в меню, которые могут развиваться как меню или на дисплее ссылку на файл, который можно посетить в августе на Gopher-сервер, другой Gopher сервер (или в любом другом месте в сети). Протокол может быть автоматически Gopher туннель с одного сервера на другой без ведома пользователя, который не нужно знать, что сервер был изменен. Gopher держит точное расположение компьютеров, скрытые от пользователя, в результате чего один из великих иллюзий взаимосвязанного меню.
Gopher позволяет пользователю сохранять расположение элемента в избранное позволяет пользователю перейти к сохранены в виде любимой позиции без повторного поиска всю структуру меню. Gopher структура меню серверы не указан и не стандартные правила на каждом сервере Gopher не является совершенно иной.
Источник: HTTP: // ТСХ. NLM. NIH. гов / ресурсы / учебники / internetdistlrn / gophrdef. HTM
Руководство пользователя и kmag;
Sarang LAKAR
Sarang @ пользователей. научная фантастика чистый
Олаф Шмидт
ojschmidt @ KDE. организация
(C) 2005 Mandriva офис по Mandriva. PL Польский перевод
Sarang LAKAR
Олаф Шмидт
И Kmag; это утилита экранная лупа. Kmag Программа '; Вы можете использовать зум экрана, как будто вы смотрите через объектив увеличивается принтами или фотографий в газете. Программа может быть полезна в различных приложениях для различных вкусов м. В исследователей, художников, projektatów сайтов и для людей с плохим зрением. Эта документация может быть полное руководство пользователя aplikacjikmag;.
KDE
kmag
К Magnifier
Введение
И Kmag; это экранная лупа инструмент для среды рабочего стола (KDE;). Может быть использован для powększenia экрана. Это приложение может быть полезно для разных людей; люди с ослабленным зрением могут использовать это приложение, чтобы увеличить часть экрана, художники могут использовать его в качестве зумом в графике, создания и проверки их работы, например. пиксельном уровне, и т.д., исследователи могут использовать представила эту заявку в powięszania изображения этого инструмента может проверить его качество. И Kmag; Также могут быть полезны для других целей, например,. делать скриншоты части możliowścią Сохранить на диск, с возможностью масштабирования экрана.
И Kmag; это очень мощный инструмент, который постоянно добавляет новые возможности. Он оптимизирован для работы на компьютерах с низкой производительностью.
Использование и kmag;
Следующий скриншот и kmag;
Скриншот & kmag;
После запуска программы & kmag; см okonienko, подобный тому, который был показан выше. Водоросли и kmag окна; показывает увеличенный объект. Это окно видно, как окно увеличения. Увеличенное изображение захватывается с экрана показано на увеличения. Powięszkoną эта часть экрана называется окно выбора.
По умолчанию и kmag; увеличивает область вокруг указателя мыши в окне зума (который можно рассматривать как движущийся объектива). Кроме того, вы можете сказать, и kmag; увеличить выбранную область экрана (режим: открывается окно выбора), или область курсора мыши на один из краев экрана (например, в режиме:. левый край экрана).
Если вы не хотите использовать мышь, чтобы powększania изображения, выберите Отключить курсор мыши. Пожалуйста, помните, что и kmag; не может обнаружить форму курсора. Таким образом, курсор показывает по умолчанию & KDE; / Qt;.
Изменение экрана вы хотите, чтобы увеличить
В окне выбора режима окне, и вы можете перемещать, изменять размер и изменить положение с помощью навигационных клавиш на klawaturze или нажав в окне масштабирования:
Клавиши со стрелками или левую кнопку мыши
По удерживается левая кнопка мыши нажата и потащил мышь, чтобы захватить и передать содержимое окна масштабирования. В окне. Вы также можете использовать клавиши со стрелками.
Сдвиг; клавиши со стрелками или & Shift и, и влево или среднюю кнопку мыши.
Кроме того, при нажатии и сдвиг; или с помощью средней кнопки мыши можно переместить окно выбора.
Ctrl; Клавиши со стрелками или Ctrl + и левую кнопку мыши
С помощью этой комбинации, вы можете изменять размер выделение окна. Помните, что вы можете заменить размер окна, захватив dolnego- правый угол.
Дополнительные функции и kmag;
И Kmag; имеет много особенностей. Вы можете распечатать увеличенное изображение непосредственно на принтер, сохранить изображение в файл, скопировать увеличенное изображение в буфер обмена (которые могут быть использованы для перемещения в другие приложения), поверните увеличенное изображение, и многие другие.
Описание меню
Меню File
Ctrl; N Файл Создать окно
Откроется новое окно и kmag;.
Ctrl; S Файл Сохранить снимок как ...
Записывает увеличенное изображение файла.
Ctrl; P Печать файлов ...
Печать текущей увеличенный вид.
Ctrl; Выход Q файла
Выход
Меню Edit
Ctrl; C Правка Копировать
Копировать в буфер обмена просмотра увеличение, что вы можете вставить в другие программы.
Посмотреть меню
F5 Посмотреть Start / Stop
При нажатии на эту иконку включается / дисплей zatrzymanieuaktualniania. Остановки снизит спрос на электроэнергию (использование CPU)
Увеличить Просмотр
Выберите коэффициент масштабирования.
Ctrl; - Просмотр Увеличить
Нажмите эту кнопку, чтобы увеличить выделенную область.
Ctrl; + Посмотреть Увеличить
Нажмите эту кнопку, чтобы увеличить выделенную область.
Обратить F6 Посмотреть
Изменяет цвета в представлении, то есть объекты, в черном появляются белые.
Вращать обзор
Устанавливает направление вращения (без вращения (0 градусов) поворот налево (90 градусов), с ног на голову (180 градусов), повернуть направо (на 270 градусов).
Обновить вид
Выберите частоту обновления (очень низкая, низкая, средняя, ​​высокая, очень высокая). Чем выше скорость, тем больше вычислительной мощности (CPU).
Меню Настройки
Ctrl; M Настройки Показать / скрыть меню
Включает / отключает строку меню Вид.
Настройки показать / скрыть главную панель инструментов
Включить / выключить панель инструментов на главном экране.
Настройки показать / скрыть мнение
Включает / отключает вид панели инструментов.
Настройки Показывать настройки панели инструментов / Скрыть
Включает / отключает настройки панели инструментов представления.
Настройки режима F1 следовать за курсором мыши
В этом режиме окно вокруг курсора мыши показано на обычное окно.
Настройки F2 окно выбора режима
В этом режиме коробка открыта площадь. Выбранная область показана в обычном окне.
Установка режима верхнего края экрана
В этом режиме курсор мыши по полю не увеличивается до тех пор, górnejkrawędzi экране.
Режим настройки левого края экрана
В этом режиме курсор мыши по полю не увеличивается до тех пор, lewejkrawędzi экране.
Установив правый край экрана Режим
В этом режиме курсор мыши по полю не увеличивается до тех пор, prawejkrawędzi экране.
Настройки режима нижней части экрана
В этом режиме курсор мыши вокруг области увеличивается до нижней кромки экрана.
F4 Настройки Показать / скрыть мыши
Показать или скрыть курсор мыши в увеличенном изображении.
Настройка параметров ярлыков ...
Открывает окно, которое позволяет настроить горячие клавиши для многих команд меню.
Настройка параметров панели инструментов ...
Открывает окно, которое позволяет вам выбрать, какие значки будут видны в панели инструментов.
Меню Помощь
& Помогите. Меню. документации;
Параметры командной строки
И Kmag; автоматически использует ярлыки по умолчанию для сохранения файла, откройте новое окно, печать, запуск / остановка обновления (кнопка перезагрузки в & Konqueror;) powięszkanie / из & и т.д.;
Ярлыки клавиатуры по умолчанию
И Ctrl; S
Сохранение содержимого окна масштабирования в файл.
F1
для переключения "использование режима мыши".
F1
Переключение в режим "окно выбора."
F4
F5
Запуск обновления окно увеличения, если он остановлен или останавливается, масштабирование обновить окно, когда обновления в настоящее время включена.
F6
Инвертировать цвета
И Ctrl; N
Откроется новое окно и kmag;.
И Ctrl; P
Откройте диалоговое окно печати для содержания окуня увеличения.
И Ctrl; P
Скопируйте содержимое окна увеличения в буфер обмена.
И Ctrl; M
Показывает / скрывает строку меню.
И Ctrl; -
Уменьшить
И Ctrl; +
Увеличить
И Ctrl; Q
Выход.
Кредиты и лицензии
И Kmag;
Copyright 2001 Программа 2003 Sarang Sarang LAKAR LAKAR Sarang @ пользователи. научная фантастика Чистая и Олаф Шмидт 2003- 2005 ojschmidt @ KDE. орг.
В сотрудничестве:
Майкл Форстер Форстер @ FMI. Пассау универсальным. де (автор оригинала)
Документация Copyright (C) 2002 LAKAR Sarang Sarang @ пользователей. научная фантастика Чистая и Олаф Шмидт 2004- 2005 ojschmidt @ KDE. организация
Польский перевод: (C) 2005 Mandriva офис по Mandriva. ан
И UnderFDL; И UnderGPL;
Установка
Как получить и kmag;
И Установить. Введение. документации;
Компиляция и установка
И Установить. собрать. документации;
Руководство пользователя и KDE;
И Лаури. Вт; И Лаури. Вт. почта;
12 июня 2005 K Desktop Environment
kmag
1
Увеличить областях экрана
kmag общие опции Qt Опции Общие
Описание
kmag, также известный как & KMagnifier; это экранная лупа. Вы можете использовать programukmagnifier; увеличить часть экрана, как увеличительное стекло используется, чтобы лучше видеть мелкий шрифт в газете или фотографии. Программа может быть полезна для ученых, художников, веб-дизайнеров и людей с плохим зрением.
Смотрите также
Более подробная документация пользователя доступна с помощью: / kmag (введите URL-адрес, в & Konqueror, или запустить KHelpCenter помощь: / kmag).
Для получения дополнительной информации о программе доступна на проекте страницах Доступность и KDE;.
Авторов
Программа и KMagnifier; была написана Олаф Шмидт ojschmidt @ KDE. ORG, Саранга LAKAR "Sarang @ пользователей. научная фантастика Чистая и Майкл Форстер Форстер @ FMI. Пассау универсальным. де
Руководство пользователя и KMouseTool;
Джефф Roush
Джефф @ KMouseTool. ком
(C) 2005 Mandriva офис по Mandriva. PL Польский перевод
Джефф Roush
И KMouseTool; кликов мыши, даже во время перерывов в Click Through. Этот инструмент был запрограммирован, чтобы помочь людям, которые делает кнопки мыши трудности щелчков. Он умный вариант перетаскивания с помощью мыши, но это требует больше практики работы с программой.
KDE
Kdeutils
KMouseTool
эргономичный
тендинит
туннельный синдром запястья
Введение
И KMouseTool; кликов мыши, даже во время перерывов в Click Through. Этот инструмент был запрограммирован, чтобы помочь людям, которые делает кнопки мыши трудности щелчков. Он умный вариант перетаскивания с помощью мыши, но это требует больше практики работы с программой.
И KMouseTool; помогает людям с ограниченными возможностями, щелкнув и перетащив мышь, многие люди смогут использовать компьютер без каких-либо серьезных проблем. К сожалению, некоторые люди могут иметь проблемы с получением даже мышь на столе, если вы испытываете боль во время работы на компьютере, и вы никогда не использовали врача, сделайте это.
Для полного понимания: & KMouseTool; помочь вам избежать боли во время нажатия мыши. Это не поможет вам, если bóluwywoływanego перемещая мышь. Все эргономические инструменты могут отличаться между собой, так что ваш успех, когда их использование может меняться.
Использование и KMouseTool;
Использование и KMouseTool; проста: & KMouseTool; наблюдает, как вы переместите мышь, то, если вы сломать мало для вас.
И KMouseTool; встроенный Интеллектуальный режим перетаскивания мышью.
Когда смарт Перетащите режим мыши активируется, и KMouseTool; приостанавливается при нажатии на кнопку мыши, если вы переместите мышь, ждать, пока вы закончите кликов до. Таким образом, вы также можете нажать и переместите мышь. Этот режим требует навыка, но при использовании этого режима, вы быстро развивать навыки.
Command Reference
KMouseTool главное окно;
И KMouseTool; варианты, главным образом, за счет использования мыши.
Начало
Паузы / Резюме работы и KMouseTool;.
Минимальный сдвиг:
Минимальное изменение в пикселях перед и KMouseTool; будет пытаться кнопкой мыши.
Задержка кнопкой мыши (1/10 сек):
Это время, когда мышь останавливается перед и KMouseTool; кликов. Вы можете попробовать расширить этот раз, если и KMouseTool; делает вас более трудно использовать
Смарт перетащить
Включить или отключить интеллектуальный режим, перетащите мышь. Остановить режим установлен по умолчанию.
Если у вас включен интеллектуальный режим сваливания, переместите поле Время (1/10 сек): она станет доступной. Это время ожидания и KMouseTool; прежде, чем нажать вверх и вниз для, если вы не переместите мышь.
Включите удара
И KMouseTool; поддерживает влияние. На вариант медленного движения правой и задней, а затем, помолчав. Создать это следующим образом: щелкните правой кнопкой мыши. Медленное движение влево и снова генерации двойной щелчок. (.. Бьется характеристики $ KDEHOME / Share / Config / kmousetool_ ударов текстовый файл Этот файл создается путем запуска и KMouseTool;. Снова изменить настройки, приложение должно запускаться снова)
Слышимым щелчком
В приложении & KMouseTool; Вы можете включить громкий щелчок, особенно полезный в режиме интеллектуального сопротивления.
Если звук, кажется, быть отложено, вы можете ускорить его & KDE;. Чтобы сделать это, откройте и Центре управления, а затем выберите пункт Звук и средств массовой информации, выберите звуковую систему, и нажмите на вкладку Вкладка Audio I / O Ниже слайдер звуковой буфер. Переместите ползунок влево, чтобы уменьшить время буферизации, и уменьшить задержку.
Запустите Центр управления KDE
Когда эта опция включена и KMouseTool; будет запускаться каждый раз при запуске и KDE; С этого момента, это приложение будет работать на & KDE;. Чтобы сделать этот вариант работы в GNOME или иначе, вы должны обратиться к документации для вашей среды.
Безоговорочно
Восстановить значения по умолчанию.
Восстановление
Восстановление заводских настроек после открытия приложения, или если вы сохранили изменения через кнопку Применить. Сбросить все настройки ранее выбранных также Применить
Применять
После изменения настроек, необходимо нажать на кнопку Apply.
Помогите
Пользователь открывает документ.
Близко
Закрытие приложения без сохранения настроек.
Отделка
Выход & KMouseTool;
Совет
Совет поможет вам знать, как правильно использовать сокращенных приложений и KMouseTool;.
Вы можете изменить задержку в & KMouseTool; нажмите и перетащите на.
Лучший вариант нажать, чтобы узнать с помощью параметров по умолчанию. Для начала вы не должны использовать опцию Смарт сопротивления. Если они уже освоили также щелкнуть, перейти к смарт-перетаскивание.
При использовании перетаскивания вариант Смарт очень полезно слышимым щелчком
При использовании громкий щелчок, необходимо установить и KDE; Звуковой буфер.
Вопросы и ответы
И отчетности. ошибки; И Обновление. документации;
Примечание! И KMouseTool; делает нажав на дисплей становится проще для вас!
Когда у вас есть приложение & KMouseTool;, вы можете приобрести большее искусство использования мыши.
Во-первых, думать о вопросе о том, когда использовать и mdash; является предпочтительным. Нажав на сером части окна или на области страницы без ссылок и это не вызовет каких-либо действий. Таким образом, вы можете переместить курсор к месту, пока вы не хотите использовать мышь.
Затем, вам нужно определить, где вы хотите, чтобы щелкнуть мышью перед его перемещением. В основном мы наведите курсор мыши на области бесцельно до сформулируйте Ваши цели. С помощью приложения и KMouseTool; Вы должны знать, где вы собираетесь нажмите Перед перемещением мыши. Это хорошо, чтобы научиться не использовать мышь без причины, если вам не нужно использовать его.
Джемы мыши. Могу ли я использовать & KMouseTool;?
Да. Если ваша мышь варенье, я должен чистить. Это просто, вы должны выбить мяч и рулон в середине мыши.
Мышь методы очистки отличаются. Самый простой способ, чтобы вытащить крышку с задней части мыши, а затем очистить его содержимое.
Затем очистите ролики и центр мышь с пылью и грязью, тонкой, сухой тканью или щеткой.
И KMouseTool; щелкает, но не вниз. Что случилось?
Очень редко паузу и система KMouseTool; когда он начинает тянуть. Если вы используете смарт Drag, это означает, что и KMouseTool; Я никогда не закончить сопротивления, нажав на.
Это произойдет, когда вы не & используя KMouseTool; И KDE;.
Решение очень простое. Нажмите вручную, восстановить и KMouseTool; и вы сможете продолжить работу.
И KMouseTool; перемещает курсор, когда я пытаюсь писать.
Проблема: Когда вы пишете текст, и KMouseTool; держит нажав и перемещает курсор в том месте, где вы хотите, чтобы продолжать писать.
Решение: Используйте мышь, чтобы переместить курсор туда, где вы хотите, чтобы написать, но когда вы будете готовы, чтобы продолжать писать, наведите курсор мыши на нейтральной области экрана. Обычный место, чтобы оставить вашу мышь на это время, это серая зона вокруг меню и панели инструментов.
Я пытаюсь использовать опцию Смарт Shift,, но я не могу использовать его при редактировании текста.
Умный ход дополнительная функция в & KMouseTool; и занимает некоторое время, чтобы привыкнуть к нему. Вы можете выделить текст, исправить его, и вырезать, так что если вы нормально работать с мышью. Наверное, вы не можете научиться в начале, вот несколько советов:
Не используйте опцию SprytnePrzeciągnięcie если вы только начинаете и KMouseTool;. Вместо этого, выделите текст, нажмите один раз на конец текста, нажмите и удерживайте нажатой клавишу переключения, когда вы нажимаете на другом конце текста.
Использование громкий щелчок. Эта опция будет играть звук щелчка, когда & KMouseTool; вызовы нажатием клавиши мыши.
Вы должны знать, где вы собираетесь, прежде чем нажать кнопку мыши, чтобы переместить его.
Авторские права и лицензия
И KMouseTool;
Программа Copyright 2002 Джефф Roush Джефф @ mousetool. ком и 2003 Гуннар Гуннар Schmi @ schmi- Dt DT. де
Сотрудники:
Джефф Roush Джефф @ mousetool. ком
Schmi Гуннар Гуннар @ schmi- Dt DT. де
Олаф Шмидт ojschmidt @ KDE. организация
Документация Copyright 2002 Джефф Roush Джефф @ mousetool. ком
Польский перевод: (C) 2005 Mandriva офис по Mandriva. ан
И UnderFDL; И UnderGPL;
Установка
Как получить и KMouseTool;
И Установить. Введение. документации;
Потребности
Для успешного использования kappname XTest;, Вам необходимо составлен для & X-Window;. Он входит в Mandriva Linux вы используете в настоящее время.
Для успешной работы опций голосовой щели нажмите кнопку, вы нужна звуковая карта и колонки, которые должны быть правильно настроен.
Компиляция и установка
И Установить. собрать. документации;
Руководство пользователя и KMouth;
Гуннар Schmi Dt
Гуннар @ schmi- DT. де
(C) 2005 Mandriva офис по Mandriva. PL Польский перевод
Гуннар Schmi Dt
И KMouth; это приложение, которое помогает людям, имеющим проблемы с произношением. Поддержка процесса производства речи при использовании компьютера.
KDE
Kdeutils
KMouth
Текст в речь
Инвалид
Введение
И KMouth; это приложение, которое помогает людям, имеющим проблемы с произношением. Поддержка процесса производства речи при использовании компьютера. Содержит историю общения предложений, что, когда вы указываете говориться программой.
И KMouth; не имеет встроенного в синтезатор речи. Вы должны установить его на вашей системе.
Пожалуйста, перешлите какие-либо комментарии по проблемам и разработчика приложений и KMouth;.
Использование и KMouth;
Первое использование
При первом запуске приложения & KMouth; помощник в котором можно настроить соответствующие параметры.
Помощник
Помощник
На первой странице мастера (в левой части экрана), вы можете выбрать параметры, которые будут использоваться в процессе преобразования текста в речь описание окна dialowego
На второй странице выберите набор выражений, что вам нужно. Выражения из коллекции, вы можете выбрать наиболее часто используемые термины, которые вы не должны ввести позже. И KMouth; также имеет диалоговое окно для редактирования Коллекция выражений.
Главное окно
Главное окно и KMouth; довольно просто. Включает в себя базовую поле редактирования, где вы находитесь предложения (текстовое поле на скриншоте), и историю выражения, употребляемые (выше текстовое поле на скриншоте).
Главное окно и KMouth;
Скриншот
Чтобы подвести итог, если вы уже настроили правильно и KMouth; настроен и KMouth; Вы можете использовать его для редактирования введенных предложения, которые вы хотите услышать. После приговора, который будет добавлен к истории. Из истории, вы сможете выбрать предложение, которое будет выражено.
Из собрания самовыражения (находится на линии под панелью инструментов), вы также можете выбрать часто используемые выражения.
Окно конфигурации
При использовании Настройка параметров & KMouth; ... открыть окно настройки & KMouth; Это окно содержит страницы: содержащая закладки из текста в речь и предпочтения страницы Завершение слов и сервисную страницу KTTSD
Закладка для текста дома
закладки из текста в речь
В Opel редактирования закладки из текста в речь, вы можете ввести команду для вызова синтезатора речи. С возможностью расширения перечня окне редактирования, вы можете указать кодировку, вам необходимо переместить текст в синтезатор речи.
И KMouth; перемещает текст в двух направлениях. Если вы летели требуется стандартный текст, вы должны проверить коробку.
Второй способность двигаться текст перемещать текст в качестве параметра: Перед вызовом команды & KMouth; преобразует фиксированное значение текущего содержания:
Placeholder
Замените
% T
Текст, который следует говорить
% F
Имя временного файла, который содержит текст, который должен быть ПРЕКРАЩЕНИЕ
% L
Код язык, связанный с текущим словарь полных слов
%
Знак процента
Конечно, говоря текст команды зависит от использования синтезатора któregoi. Пожалуйста, обратитесь к документации синтезатора речи. Примеры можно найти в приложении команды.
Выбрав использования KTTSD речи службу, если можно дать это приложение, чтобы отправить текстовое к сайту KTTSD Если команда выполнена успешно, другие выбранные конфигурации игнорируются. KTTSD речь обслуживание демон, который дает приложений & KDE; Стандартный интерфейс программирования для синтеза речи и в настоящее время разработаны в SVN. Это безопасно, чтобы выбрать эту опцию, даже если не установлен KTTSD.
Вкладка Настройки
Вкладка Настройки
Вкладка Настройка содержит параметры, которые делают альтернативное поведение & KMouth; в конкретных ситуациях.
В первые выражений список Урожай Выбор и выбрать то, что действие выполняется после выражения хэш выбранной коллекции выражений в строке меню фраз или разговорника.
При выборе сразу сказать выбранное выражение немедленно прекращается и положить в историю. Если вы выбираете Введите в поле ввода выбранного выражения является tylkowstawione поле ввода.
Во втором списке выбора, закройте окно редактирования альбома фразу: следует указать, коллекция выражений сохраняется или закрыта только при выходе из редактирования разговорник.
При выборе команды фразу Сохранить выражения Сборник будет сохранен. Если вы решите отменить изменения, изменения не будут сохранены. При выборе Подскажите, когда вы подписываетесь и KMouth; будет задан вопрос, чтобы сохранить изменения в разговорник.
Закладка завершения слова
Закладка завершения слова
Вкладку Завершение содержит список словарей слов, полезных для получения слова (KMouth, отображает список выбора для следующего издания полей в основной окуня, если список содержит более одного Śliwnik. Вы можете использовать этот список для выбора словарь, который в настоящее время используется для составления слов.)
Главная Услуги KTTSD
Фраза окно редактирования альбома
При использовании polecienia меню выражения Коллекция Редактировать ... вы открываете окно редактирования альбома фразу.
Коллекция выражений окне редактирования
Скриншоты
Основная область окна редактирования альбома фраза делится на две части. В верхней части фраза книги и структур отображаются.
В нижней части, вы можете изменить выбранные элементы. Если вы выбрали фразу, вы можете изменить его содержание, а также ярлык для него. Если вы выбрали коллекцию выражений, можно изменить только свое имя.
Опции, такие как добавление нового выражения в разговорника или удалить выбранное выражение или сбор можно сделать, выбрав их в строке меню, панель инструментов, либо с помощью контекстного меню.
Изменить разговорник и выражения может быть сделано путем перетаскивания их на новом месте, или с помощью клавиш со стрелками и удерживайте клавишу Alt &;.
Меню polecień Список
Команды в главном окне
Меню File
Ctrl; Открыть файл история ...
Открыть текстовый файл в истории wypowiedzinego предложения.
Ctrl; S Файл Сохранить историю как ...
Хранить историю в текстовом файле.
Ctrl; P Файл Печать история ...
Печать История.
Ctrl; Выход Q файла
Отделка и KMouth;
Меню Edit
Ctrl; X Правка Вырезать
Удаление выбранного раздела и перемещения в буфер обмена. Если в издании выделенного текста будут перемещены в буфер обмена. В противном случае, выбранные предложения в истории также передаются в буфер обмена.
Ctrl; C Правка Копировать
Скопируйте выбранный раздел в буфер обмена. Если выделен текст в поле редактирования оно копируется в буфер обмена. Также выбранные предложения в истории, они копируют в буфер обмена.
Ctrl; V Правка Вставить
Вставить содержимое буфера обмена и переместите курсор в поле ввода.
Редактировать Speak
Говорите себе aktywnychzdania, наказание в окне редактирования, если есть какой-либо текст языков. Также выбранные предложения в истории говорят.
Меню Эмоции Коллекции
Редактирование Выражения коллекция ...
Открытие выражения Окно редактирования набора.
Меню Настройки
Ctrl; M Настройки Показать меню
Настройки Показать панель инструментов
При выборе отображает плавающей панели инструментов с кнопками полезные баллотироваться на общих команд. Панель инструментов в основном расположены в верхней части редактора, сразу под строкой меню. Если флажок снят, панель инструментов скрыта .. При нажатии на ребристой ручкой, ремень может быть перемещен.
Настройки Показывать строку состояния
При выборе отображает небольшой бар на кнопку в главном окне содержится информация о состоянии заявки и KMouth; Если флажок снят строка состояния скрыта.
Настройки Показывать набор слов
При выборе отображает движущийся бар разговорник, содержащий записи для урожая. Ремень разговорник в основном расположены в верхней части редактора, чуть ниже панели инструментов. Если флажок снят, бар скрыт разговорник. нажав на ребристой руле, чтобы показать или скрыть. Перетаскивая ручку позволяет перемещать планку.
Параметры конфигурации KMouth ...
Откройте диалоговое окно конфигурации для синтезатора речи и других настроек и KMouth;.
Меню Помощь
& Помогите. Меню. документации;
Всплывающее меню записей истории
Речь
Выбор предложений по произношению.
Удалять
Удаление выбранных предложений из истории.
Вырезать
Снятие или передача отдельных предложений в буфер обмена.
Дублирование
Скопируйте выбранные предложения в буфер обмена.
Отметить все предметы
Отметить все записи в истории.
Снимите все элементы
Снимает все записи в истории.
Ctrl; О Open как история ...
Ctrl; S Сохранить историю как ...
Команды в окне редактирования событий сообщает
Файлы новое выражение
Добавление новых выражений.
Файлы Новая коллекция выражений
Добавление нового разговорник.
Ctrl; S Хранить файлы
Поведение разговорника.
Импорт файлов ...
Plków Импорт и импортом их содержимого, в разговорника
Импорт файлов выражения Стандартная Коллекция
Урожай Импорт стандартные выражения и импортом их содержимого, в разговорника
Экспорт файлов ...
Экспорт тока, выбранные фразы или выражения, установленные в файл
Ctrl; P Печать файлов ...
Распечатать выбранный набор выражений или выражений
Ctrl; Файлы Закрыть
Закрыть Окон
Вырезать выделенный przedmoty и переместить их в буфер обмена.
Скопируйте выбранные элементы в буфер обмена.
Zawartołść вставить из буфера обмена в виде набора выражений.
Редактировать Удалить
Удалить выбранные элементы.
Всплывающее меню
Новые выражения
Новая фраза
Импорт ...
Импорт стандартный разговорник
Экспорт ...
Ctrl; X Вырезать
Ctrl; C Копировать
Ctrl; V Вставить
Вставить содержимое буфера обмена в разговорника.
Вопросы и ответы
И отчетности. ошибки; И Обновление. документации;
Я ничего не мог услышать.
Вероятно, это не правильно настроен (или не имеют его вообще), нажмите text- любой вопрос. Используйте настройки, откройте страницу Общие и введите команду, которая будет использоваться для выражения текст в закладке текста в речь. (Для больше на этой теме в диалоге настройки речи).
Кредиты и лицензии
Kappname;
Copyright 2002- программа 2004 Schmi Гуннар Гуннар @ schmi- Dt Dt. де
Copyright 2002- 2004 документация Schmi Гуннар Гуннар @ schmi- Dt Dt. де
Благодаря для переводчиков
И UnderFDL; И UnderGPL;
Возможность отправлять данные в стандартный ввод должен быть включен.
Третий пример, чтобы отправить данные в виде Размер Нормальный вход должен быть включен. (Это jedynyny предпочтительный пример для использования свободного TTS)
Все части команд необходимо ввести в одну строку. Возможность отправлять данные в качестве стандартного ввода должен быть включен до нашей эры.
При настройке KTTSD синтезатор речи в & KMouth;: нужно активировать опцию Использовать KTTSD службы, если это возможно.
Конечно, вам нужно настроить KTTSD. Вы можете сделать это на речевом службы вкладка KTTSD, который появляется в окне конфигурации и KMouth; если установлен KTTSD.
Установка
Как получить и KMouth;
И Установить. Введение. документации;
Потребности
Для правильного использования и KMouth; нужен синтезатор речи (и, конечно, и KDE; 3 х). И KMouth; требуется 15 МБ памяти для запуска (плюс объем памяти, необходимый для запуска синтезатора речи), это зависит от платформы и конфигурации.
Компиляция и установка
И Установить. собрать. документации;
Конфигурация сети и KDE;
Шон Wheller
По словам Techdoc Решения Шон @ inwords. CO. для
Кристоф Эккерт
Майкл Bendowski Bendowski @ gmail.com. ком
По словам Techdoc решений
Кристоф Эккерт
Это руководство описывает, как установить и использовать и knetworkconf;, & модуль Центре управления, которая позволяет управлять сетевыми устройствами, маршрутизации (маршрутизация), а также настройки DNS.
KDE
сеть
Ethernet
Вход
И Центре управления; предоставляет пользователям единый интегрированный интерфейс, который позволяет управлять различными настройками системы и среды рабочего стола. И Центре управления; можно запустить, выбрав в меню Центре управления К;.
Пакет & knetworkconf; была создана, чтобы позволить пользователям управлять настройками для сети TCP / IP, таким же образом, в котором они управляют другие настройки и Центре управления. И Knetworkconf; предоставляет пользователям простой интерфейс для выполнения следующих шагов:
Назначение IP-адреса интерфейсов
Трансляция сетевых интерфейсов маски
Включение и отключение интерфейса
Настройка маршрутизации (маршрутизация)
Именование компьютер и домен
Настроить разрешение имен
Управление компьютерами известно
После установки нового модуля под названием Настройки сети становится видимым;, & Центре управления Интернет группа и сеть. Чтобы начать модуль Сетевые настройки (knetworkconf;), выберите Интернет и сетевые настройки сети.
И Knetworkconf; в пользовательском режиме
Важно понимать, что и knetworkconf; Не удается установить сетевое оборудование. Оба устройства и их драйверы должны быть правильно установлены и настроены на использование и knetworkconf; Для отображения устройство и включить сетевое управление.
В большинстве случаев драйверы для сетевого оборудования и других устройств установлены и настроены во время установки Linux. Если добавить сетевое оборудование после установки, вы должны будете указать необходимые драйверы, редактируя один из следующих файлов, в зависимости от версии ядра:
Ядро и Linux; Вариант 2, 4 и нижней
/ И т.д. / модули. конф
Ядро и Linux; Вариант 2, 6 и выше,
/ И т.д. / Modprobe. конф
Использование модуля сетевые настройки
Модуль настройки сетевого загружается при выборе сетевых настроек & Центре управления. Когда вы начинаете модуль настройки сети пытается автоматически определить системную платформу.
Если платформа не признается, вам будет предложено вручную выбрать платформу. Выберите из списка платформе, которая наилучшим образом соответствует вашим дистрибутивом и его освобождения. Выберите не спрашивать выбрать платформу на постоянной основе. В следующий раз модуль настройки сети запускается, система автоматически установит выбранную платформу.
Для управления системой настройки сети вам нужно идти в режиме администратора. Прежде чем сделать это, все опции будут затемнены, что означает, что вы будете смотреть только интерфейсы и их свойства. Редактирование отключена. Чтобы войти в режим администратора, нажмите кнопку Режим администратора в левом нижнем углу модуля. При появлении запроса на ввод пароля введите его в поле.
knetworkconf; в режиме администратора
knetworkconf; в режиме администратора
В РЕЖИМ администратор модуля включен. Он был разделен на три вкладки:
Управление сетевыми интерфейсами
Вкладка сетевых интерфейсов используется для управления устройствами, установленными в системе связи с сетью. Все доступные устройства показано на рисунке. Вкладка сетевых интерфейсов, вы можете сделать следующее:
Интерфейс & knetworkconf;
Это можно прочитать следующие свойства каждого сетевого устройства:
Интерфейс
Показывает имя сетевого интерфейса, например. Eth0, eth1, wlan0.
IP-адрес
Показывает назначенный IP-адрес.
Протокол
Показывает настройки адреса протокола.
Государственный
Показывает текущее состояние (включен или выключен).
Комментарий
Показывает (свободно назначаемый) комментарий.
Конфигурация сетевых устройств
Свойства перечисленных сетевых устройств можно изменить, выбрав список выбранного устройства и нажмите интерфейс кнопку Настройка, чтобы открыть диалоговое окно Конфигурация устройства.
Конфигурация сетевых устройств
Конфигурация сетевых устройств
По умолчанию, показывать только основную TCP / IP. Нажмите кнопку Дополнительные параметры, чтобы развернуть диалоговое окно для дополнительных настроек.
Расширенная настройка устройства
В диалоговом окне содержит следующие параметры:
Автоматически
Выберите Автоматически, если настройки TCP / IP получают из DHCP-сервера или BOOTP. В автоматическом режиме настройки TCP / IP настроены во время запуска системы система услуг. DHCP или BOOTP сервер посылает всю необходимую информацию TCP / IP каждый раз при старте системы, нет необходимости настраивать любые параметры. Выберите из раскрывающегося списка DHCP или BOOTP, по мере необходимости для вашего сетевого протокола.
Вручную
Выберите руководство, если вы не используете DHCP или BOOTP для настройки протокола TCP / IP. В поле IP-адрес введите TCP / IP-адрес вашего компьютера. Поле Network Mask, введите адрес подсети.
Активируйте при запуске компьютера
Если эта опция включена, сетевой интерфейс при запуске системы включена. Если вы не хотите устройство активно, и выключите эту опцию.
Описание
Введите описательное имя.
Трансляция адрес
Введите широковещательный адрес, используемый для связи со всеми хостами в подсети.
Значения, введенные в этом диалоге будут отображаться как свойства устройства в списке устройств.
Убедитесь, что IP-адреса, введенного еще не используется в сети. Введите IP-адрес, который уже используется в сети будет TCP / IP конфликт. Используйте таблицу в консоли, чтобы увидеть, если адрес, который вы хотите ввести в использовании или нет. Если вы не знаете, как завершить этот диалог, обратитесь к администратору сети.
Включение сетевого устройства
Сетевые устройства может быть включен или выключен в зависимости от требований системы. Чтобы выключить сетевое устройство, выберите его из списка и нажмите кнопку Включить интерфейс.
Отключение сетевых устройств
Сетевые устройства может быть включен или выключен в зависимости от требований системы. Чтобы отключить сетевого устройства, выберите его из списка и нажмите Отключить интерфейс.
Система маршрутизации Management (маршрутизация)
Маршруты карта (маршрутизация) для управления конфигурацией системы маршрутизации (маршрутизация).
Шлюз по умолчанию
Этот параметр определяет IP-адрес компьютера в локальной подсети, которая обеспечивает соединения с удаленными сетями и используется по умолчанию, когда ваш компьютер должен взаимодействовать с компьютерами в других подсетях.
Выберите устройство из выпадающего списка, чтобы изменить шлюз по умолчанию.
Если ваш компьютер имеет более одного сетевого устройства, выберите интерфейс, подключенный к сети, который является воротами компьютер.
Управление настройками DNS
Data Domain, Name System (DNS) позволяет управлять настройками DNS.
Имя компьютера
Имя, под которым компьютер появится в подсети.
Доменное имя
Доменное имя, в котором находится компьютер.
Серверов доменных имен (DNS)
Список серверов доменных имен в порядке предпочтения (см).
Статические хосты
Список известных хостов в подсети (см).
Управление DNS-серверов
Компьютер, на котором запущен сервер доменных имен, полное имя ассоциируется с соответствующим IP домена адресу. Это необходимо потому, что компьютеры понимают только IP-адреса. Когда хозяин хочет, чтобы связаться с домена WWW. неважно. Доменное имя COM-сервер расширяет это имя к IP адресу, например, 123. 45. 678. 90.
Серверов доменных имен части вкладки Domain Name System позволяет Вам легко управлять список серверов имен, используемых. Серверы могут быть добавлены, удалены или изменены, и расположены в порядке предпочтения, выбрав сервер в списке и переместить его вверх или вниз кнопки Move Up и Move Down по мере необходимости.
Добавление DNS-сервер
В серверов доменных имен, нажмите кнопку Добавить .... Появится диалоговое окно доменные имена Добавить сервер.
Введите IP-адрес DNS-сервера, а затем нажмите кнопку Добавить. Запись добавляется в список серверов.
Редактирование DNS-сервер
В серверов доменных имен группы выберите DNS-сервер, а затем нажмите кнопку Изменить .... Появится диалоговое окно Edit Server.
Редактирование DNS-сервер
Измените IP-адрес, а затем нажмите OK. Запись обновляется в списке серверов имен.
Управление компьютерами известно
Список Хозяева назначать каждой паре имен хостов и адресов для подсистемы TCP / IP. Он в основном используется во время загрузки, когда нет сервера имен не работает. В небольшой, закрытые сети может быть использован вместо серверов доменных имен (DNS).
По умолчанию, список хостов содержит записи, описывающие & APOS; lokalnyapos компьютер; и несколько специальных записей для хостов, поддерживающих IPv6. Это экспериментальный протокол для будущего, чтобы заменить IP версии 4.
Добавление статических хостов
Нажмите кнопку Добавить .... Появится диалоговое окно Добавить новый компьютер известно.
Введите IP-адрес известного хозяина, а затем нажмите кнопку Добавить .... Появится диалоговое окно Добавить новый псевдоним.
Введите имя хорошо известного компьютера, а затем нажмите кнопку Добавить. Если вы знаете, что ваш компьютер имеет несколько псевдонимов, нажмите кнопку Добавить еще раз и введите другой псевдоним.
Когда вы закончите, нажмите кнопку ОК, чтобы обновить список известных хостов.
Редактирование статических хостов
Выберите хорошо известный компьютер из списка, а затем нажмите кнопку Изменить. Появится диалоговое окно Edit известный компьютер.
Выполните одно из следующих действий, а затем нажмите кнопку ОК, чтобы обновить список известных хостов.
Чтобы изменить IP-адрес, введите новый IP-адрес, а затем нажмите OK.
Чтобы добавить новый псевдоним, нажмите кнопку Добавить ....
Чтобы изменить значение псевдонима, выберите его из списка и нажмите кнопку Изменить.
Чтобы удалить псевдоним, выберите его из списка и нажмите кнопку Удалить.
Применение изменений
Изменения, внесенные с помощью сетевых настроек автоматически применяются к системе. Чтобы применить новые параметры, запустите и Консоль; и выполните следующую команду.
/ И т.д. / инициализации. d / сетей перезагрузка
Установка
Потребности
Для использования и knetworkconf; Обязательный и KDE; 3. х и QT 3. х.
И Knetworkconf; может быть использован со следующими платформами:
И Kubuntu;
Conectiva
Debian
Fedora Core
FreeBSD
Gentoo
Mandrake;
PLD
OPENn
RedHat;
SuSE;
Как получить и knetworkconf;
Исходные файлы (и не только) можно загрузить с домашней страницы и knetworkconf; находится по адресу: // knetworkconf. SourceForge. сеть.
Установка бинарных файлов
Если вы используете бинарный дистрибутив пакетов (чаще всего они используют RPM Packages), то достаточно иметь двоичные файлы & KDE; и QT.
Установка бинарных файлов рекомендуется для менее опытных пользователей. Просто загрузите RPM пакеты и установить их с & Konsole; с использованием RPM следующим образом:
мин - и knetwork- conf- numerwersji. оборотов в минуту
Кроме того, вы можете использовать графический пользовательский интерфейс, например, KPackage или установки инструмента вашего дистрибутива.
Компиляция и установка
В этом случае, это не достаточно, чтобы иметь исполняемые файлы QT и & KDE; - Вы также должны пакетов для разработчиков (Dev), которые включают библиотеки и другие необходимые компоненты.
Рекомендуется для опытных пользователей. В противном случае, строить и knetworkconf; Это не сложно. Следующие команды должно быть достаточно.
, / Настройка - префикс = $ (KDE-конфигурации - приставка) делают сделать установку
Сделать установки команда должна быть выполнена с правами администратора (корень).
Этого должно быть достаточно. Если вы столкнулись с проблемой, пожалуйста, сообщите нам.
Техническая информация
В первой части этой главы вы найдете ценную информацию об основах компьютерных сетей. Вторая часть будет обсудить все файлы, которые могут быть изменены и knetworkconf;.
Сети IPv4
Эта часть не может заменить литературу по сетям IP. В этом приложении вы найдете только основную информацию, которая поможет вам подключить компьютер к небольшой сети (дома).
В настоящее время IP-сети используют TCP / IP версии 4 (IPv4). IPv5 не был использован в большом масштабе. Предполагается, что в будущем, распространение стандарта IPv6. Таким образом, это руководство основано на в настоящее время самой популярной IPv4.
Один из наиболее важной информации, необходимой для запуска сетевого интерфейса IP-адрес, который вы даете ему. В зарубежных сетей, например. В вашем офисе, вы должны узнать IP-адрес у вашего сетевого администратора. Вы также можете использовать DHCP, если таковые имеются. В любом случае, вы не можете выбрать любой IP-адрес!
Если вы хотите, чтобы начать свой собственный небольшой сети (дома), вы должны использовать IP-адреса в диапазоне, который был специально предназначенной для этого, для того, чтобы избежать конфликтов с глобальной сети (Интернет). Адреса таблице не используются в Интернете, так что вы можете использовать их с уверенностью.
Конечно, эти машины могут позже быть настроен для подключения к Интернету через шлюз.
Вы можете свободно использовать следующие адреса:
IP адреса частной сети
Класс
Интервал
И
10. 0. 0. 0 10. 255. 255. 255
В
из 172. 16. 0. 0 0. 172 31. 0
C
0 из 192. 0 до 168. 168. 192. 255. 0
Для небольших сетей, которые чаще всего используются адреса в диапазоне от 192 до 168. 1. 1 192. 168. 1. 254 Этого достаточно для сетей до 250 компьютеров.
Кроме того, маска сети, в основном, устанавливается на 255. 255. 255. 0, так что все компьютеры находятся в одной подсети.
Некоторые адреса зарезервированы для специальных целей, например. 0. 0. 0. 0 до 127. 0. 0. 1. Первый называется. Маршрут по умолчанию, второй петлевой адрес. Маршрут по умолчанию используется в IP-маршрутизации (маршрутизация).
Сеть 127. 0. 0. 1 зарезервирована для IP-трафика, который выполняется только на локальном компьютере. Обычно решения 127. 0. 0. 1 присваивается специальное устройство, называемое. интерфейс обратной связи (с обратной связью), который выступает в качестве замкнутого контура.
Шлюз по умолчанию компьютер, который соединяет две различные сети. Если вы создали свой собственный небольшой сети, это очень вероятно, что вы хотите, чтобы все (или некоторые) компьютеры имеют доступ к Интернету. Тем не менее, это не представляется возможным непосредственно, потому что эти машины используют местные частные IP-адреса, которые не направляются в Интернет. Решение компьютер, который переводит между двумя разными сетями. Этот компьютер использует по меньшей мере, два сетевых устройств. Один из них, возможно, сетевая карта подключается к локальной сети, последний, например. ISDN, Интернет. Оба устройства используют различные IP-адреса. Компьютер выполняет так называемую. перевод сетевых адресов (NAT, IP-Forwarding). Чтобы включить локальном компьютере доступ в Интернет, просто скажите им шлюз по умолчанию, которое является Локальный IP-адрес шлюза компьютеризированных.
Файлы конфигурации
В этом разделе вы найдете список конфигурационных файлов, которые были изменены с помощью & knetworkconf; и вы узнаете, где найти их в различных дистрибутивах.
Резолв. конф
Этот файл хранит список серверов имен.
Где найти Резолв файл. конф
Платформа
Издание
Расположение
Conectiva
9. 2
/ И т.д. / Резолв. конф
Debian
3. 0
Fedora Core
1
FreeBSD
5
Gentoo
Mandrake;
PLD
2. 0
OPENn
1. 0
RedHat;
9. 0
SuSE;
Файл иногда изменить динамически с помощью DSL-соединения, так что не удивляйтесь, если файл не содержит информацию, введенную вами, когда соединение DSL.
Хозяева
Этот файл хранит список известных хостов.
Где найти хост-файл
Распределение
Издание
/ и т.д. / хостов
И Nbsp;
Распределение и SuSE; файл иногда изменен SuSEconfig сценария, так что не удивляйтесь, если интересно, если вы утверждаете, вы не ожидаете.
Авторские права и лицензия
Благодаря
Спасибо всем, кто работал над & knetworkconf;:
Разработчиков
Хуан Луис Батист юаней. Батист @ kdemail. чистый
Дэвид Sansome мне @ davidsansome. ком
Карлос Garnacho garnacho @ tuxerver. чистый
Саймон Эдвардс Саймон @ simonzone. ком
Педро Хурадо Maquedo pjmelenas @ biwemail. ком
Флориан Флориан Фернандес. fernandez2 @ Wanadoo. FR
Унаи Унаи Garro. Garro @ EE. редактор переменного тока. Великобритания
Кристоф Эккерт mchristoph. Эккерт @ T-Online. де
Хайме Торрес jtorres @ telecorp. чистый
Все, о котором я забыл упомянуть здесь - вы знаете, кто вы вы @ Foo. TLD
Авторов
Кристоф Эккерт: mchristoph. Эккерт @ T-Online. де
Шон Wheller: Шон @ inwords. CO. для
Лицензия
Авторские права на & knetworkconf; по крайней мере за годы 2003 и 2004 относятся к Хуан Луис Батиста (юань Батист @ kdemail сетка..).
Майкл Bendowski Bendowski @ gmail.com. ком
И UnderFDL; И UnderGPL;
Руководство и KCron;
Morgan Н. Sandquist
И Морган. Н. Sandquist. почта;
Гэри Мейер
Автор
Лаури Уоттс
Рецензент
Майкл Bendowski Bendowski @ gmail.com. ком
И Морган. Н. Sandquist;
И KCron; это программа, которая позволяет вам планировать для запуска некоторых программ в определенное время.
KDE
kdeadmin
KCron
крон
кронтаб
Планировщик
Вход
И KCron; является планирование программы Программы для работы в фоновом режиме. Это графический пользовательский интерфейс для Unix хрон планировщика.
Использование и KCron;
Не забудьте включить систему crond демона, иначе и KCron; не будет работать.
Начиная & KCron;
Когда вы начинаете & KCron; Вы увидите сводку всех запланированных задач и связанных с ними параметров окружающей среды. Если вы действуете в качестве администратора (корень), вы увидите все задачи пользователей и системных задач. Каждая папка может быть расширен и снова рухнул.
KCron; во время запуска.
KCron; во время запуска.
Запланированные задачи
Запланированные задачи отображаются в папке Задачи. Каждый запланированный задача описаны в следующих свойств:
Имя
ID задания.
Значение
Название программы и ее параметров.
Описание
Язык описания запланированной задачи.
Если задача выключена, то не будет название программы и ее описание будет отключена.
Переменные среды
Переменные окружения показано в папке переменных. Для каждой переменной окружения отображается:
Имя переменной
Значение переменной.
Понятно, описание переменной.
Появляющиеся здесь переменные окружения переопределяют все остальные переменные среды для запланированных задач. Если переменная выключена, то не будет никакого значения, и описание будет отключена.
Главное окно и KCron;
Главное окно и KCron;
Добавление задач
Чтобы добавить новую задачу, сначала выберите папку Задачи, а затем выберите Edit New .... Вы также можете щелкнуть правой кнопкой мыши и из появившегося меню выберите Создать ..., или просто нажать Ctrl; Н.
Диалоговое окно Edit Task
Диалоговое окно Edit Task.
Диалоговое окно Edit Task
Комментарий
Позволяет ввести описание предполагаемого задачи.
Программа
Позволяет ввести имя программы. Вы можете ввести абсолютный или относительный путь. Если вы хотите, вы можете нажать кнопку Обзор ... и укажите программу в диалоговом окне.
Включено
Чтобы включить задание, выберите или отмените Включить.
Без сообщений
Отключение журнал как команды и ее результатов.
Месяцы
Выберите месяцы, в которых работа должна быть бежать.
Дни месяца
Выберите дни месяца, в котором работа должна быть бежать.
Дни недели
Выберите дни недели, по которым работа должна быть бежать.
Ежедневно
Если вы хотите работа была zaplanowne ежедневно, выберите Выполнять каждый день.
Часов
Выберите часов, в течение которых работа должна быть бежать.
Минут
Выберите минуту, в котором работа должна быть бежать. Программа и KCron; браузер не поддерживает задачи, запланированные с зазором менее пяти минут.
ХОРОШО
Завершение формирования задачи.
Отменить
Отмена создании задачи.
Если вы выберите оба дня месяца и недели, задача выполнена, когда какой-либо из этих условий будет выполнено. Например - если вы выберите первый и пятнадцатый день месяца и каждое воскресенье, программа будет работать каждый из первого и пятнадцатого дня выбранного месяца (независимо от падающего день недели) и каждое воскресенье отдельных месяцев (независимо от дня месяца через).
Запланированная задача не сохраняется до тех пор, Изменения не будут сохранены в кронтаб
Управление запланированными заданиями
Так же, как при создании новых задач, изменения в существующих рабочих мест будут сохранены только тогда, когда кронтаб файл будет сохранен.
Резка Назначенные задания
Чтобы сократить запланированное задание, вы должны сначала выбрать его. Затем выберите Edit Cut.
Вы также можете использовать правую кнопку мыши и выберите Вырезать или просто нажать Ctrl; X.
Копирование запланированных заданий
Чтобы скопировать запланированное задание, вы должны сначала выбрать его. Затем выберите Правка Копировать
Вы также можете использовать правую кнопку мыши и выберите Копировать или просто нажать Ctrl; C.
Вставка запланированных заданий
Чтобы вставить задачу, он должен быть вырезан или скопирован в буфер обмена. Когда работа была вырезан или скопирован в буфер обмена, вариант пасты становится активным. Чтобы вставить работу, выберите папку Задачи, а затем выберите команду Вставить в меню Правка.
Вы также можете использовать правую кнопку мыши и выберите Вставить или просто нажать Ctrl; В.
Изменение Назначенные задания
Чтобы изменить задачу, необходимо сначала выбрать его. Затем выберите Edit Редактировать ....
Вы также можете использовать правую кнопку мыши и выберите в меню Правка, или просто нажмите Ctrl; О. Вы увидите диалоговое окно Edit задач.
Удаление запланированных задач
Чтобы удалить задачу, необходимо сначала выбрать его. Затем выберите Удалить из меню Правка.
Вы также можете использовать правую кнопку мыши и выберите Удалить.
Включение и отключение Назначенные задания
Чтобы включить или выключить работу, вы должны сначала выбрать его. Off описание работы будет включать в себя слово Off. Затем выберите Edit Включено.
Вы также можете использовать правую кнопку мыши и выберите Включено. Убедитесь, что имя, описание и параметры запланированного задания являются правильными.
Выполнении задач по расписанию
Для запуска задачи по расписанию, в то время, выбрать его, а затем выберите Редактировать Выполнить.
Вы также можете использовать правую кнопку мыши и выберите Выполнить.
Добавление переменных окружения
Чтобы создать новую переменную окружения, сначала выберите папку Переменные. Затем выберите Edit New ....
Вы также можете использовать правую кнопку мыши и выберите New ..., или просто нажать Ctrl; Н.
Редактировать диалог Переменная
Редактировать диалог переменной.
Редактировать диалог переменной.
Переменная
Введите имя переменной. Вы можете использовать выпадающее меню для выбора наиболее общие переменные окружения, используемые в запланированных задач. Они включают в себя:
ГЛАВНАЯ
Содержание этой переменной будет использоваться вместо домашнего каталога пользователя по умолчанию в.
MAILTO
Адрес электронной почты включены в этой переменной будет использоваться для отправки электронной почты, а адрес электронной почты по умолчанию пользователя.
PATH
Путь к каталогу, в котором файлы могут быть программы.
SHELL
Оболочка, которая будет использоваться вместо оболочки пользователя по умолчанию.
Введите значение переменной.
Введите описание переменной окружения, таких как ее цели.
Включено
Чтобы включить или отключить переменную, выбрать или отменить выберите Включено.
Утверждает установки этой переменной окружения.
Отмена настройки переменной окружения.
Переменная среды не установлена, пока кронтаб не будут сохранены.
Управление переменные окружения
Как и в создании новых переменных окружения, изменения переменных, не будут сохранены, не будут сохранены, пока файл кронтаб.
Резка Переменные среды
Чтобы сократить переменную окружения, вы должны сначала выбрать его. Затем выберите Вырезать из меню Правка.
Скопируйте переменные окружения
Чтобы скопировать переменную окружения, вы должны сначала выбрать его. Затем выберите Копировать из меню Правка.
Вы также можете использовать правую кнопку мыши и выберите Копировать или просто нажать Ctrl; C.
Переменные Вставить окружающей среды
Чтобы вставить переменную окружения, он должен быть вырезан или скопирован в буфер обмена. Когда переменная была вырезан или скопирован в буфер обмена и вставить опция становится активной. Чтобы вставить переменную, выберите папку Переменные, а затем выберите команду Вставить в меню Правка.
Редактирование переменных окружения
Чтобы изменить переменную, вы должны сначала выбрать его. Затем выберите Edit Редактировать .... Вы также можете использовать правую кнопку мыши и выберите Изменить или просто нажмите Ctrl; А. Вы увидите диалоговое окно Edit Variable, где вы можете редактировать переменные таким же образом, как описано выше.
Удаление переменных окружения
Чтобы удалить переменную, необходимо сначала выбрать его. Затем выберите Удалить из меню Правка.
Включение и выключение переменные окружения
Чтобы включить или отключить переменную, вы должны сначала выбрать его. Переменные для инвалидов будут включены в описание слова Выкл. Затем выберите Edit Включено.
Вы также можете использовать правую кнопку мыши и выберите Включено. Убедитесь, что имя и значение переменной является правильным.
Сохранение кронтаб
После того, как все запланированные задачи и переменные окружения были созданы и / или должным образом изменены, сохраните файл кронтаб, выбрав Сохранить из меню Файл.
Вы также можете использовать Ctrl; С. Пока вы этого не сделаете, не будет каких-либо изменений.
Печать (Crontab)
Чтобы распечатать Планировщик в том виде, в котором он был записан, выберите Печать в меню Файл.
Печать
Печать
Вы увидите диалоговое окно & KDE печати по умолчанию;. Если вы щелкните Параметры увидите две дополнительные опции печати, характеристика и KCron;.
График печати
Вы можете распечатать график кронтаб файл текущего пользователя.
Печать всех пользователей
Вы можете распечатать всем пользователям Планировщик файлов. Эта опция доступна только для пользователей с правами администратора.
Команды
Главное окно и KCron;
Меню File
Ctrl; S Файл Сохранить
Сохраняет изменения в кронтаб.
Ctrl; P Файл Печать ...
Печатает содержимое файла кронтаб.
Ctrl; Выход Q файла
Выходы и KCron;.
Меню Edit
Ctrl; X Правка Вырезать
Вырезать выбранную задачу или переменную.
Ctrl; C Правка Копировать
Скопируйте выбранную задачу или переменную.
Ctrl; V Правка Вставить
Переменная Вставить задача или среда, которая ранее была вырезать или скопировать.
Ctrl; N Edit New ...
Создайте новую задачу или переменную.
Ctrl; О Править ...
Позволяет редактировать переменную задач или окружающей среды.
Редактировать Удалить
Удаляет выбранные переменные задачи или окружающей среды.
Редактировать Включено
Позволяет включить или отключить запланированное задание или переменную окружения.
Редактировать Запустить сейчас
Запуск выбранной задачи.
Меню Настройки
Настройки Показать панель инструментов
Отображает панель инструментов.
Настройки Показывать Statusbar
Отображает строку состояния.
Меню Помощь
& Помогите. Меню. документации;
Вопросы и ответы
Почему изменения к задачам и / или переменных окружения оказывают никакого влияния?
Любое изменение в запланированные задания не сделал, пока кронтаб файл не будет сохранен.
Авторские права и лицензия
И KCron;
Программа Copyright: Copyright 2000 & Gary. Мейер; И Гэри. Мейер. почта;
Документация Copyright (C) 2000 и Морган. Н. Sandquist; И Морган. Н. Sandquist. почта;
Польский Перевод документации: Майкл Bendowski Bendowski @ gmail.com. ком
И UnderFDL; И UnderGPL;
Установка
Как получить и KCron;?
И Установить. Введение. документации;
Потребности
Для компиляции программы установки, & KCron; успешно, вы должны установить следующие библиотеки:
Cron Cron например vixie-. Программа и KCron; используйте команду кронтаб изменять задания пользователя.
Тип операционной системы и UNIX; POSIX-совместимым. Программа и KCron; использует несколько стандартных и UNIX системных вызовов; для форматирования даты и времени. Эти материалы предоставляются м. В. Библиотека Glibc.
Компиляция и установка
И Установить. собрать. документации;
Руководство и KUser;
Мэтт Джонстон
И Мэтт. Джонстон. почта;
Лаури Уоттс
Рецензент
Джонатан Сингер
Майкл Bendowski Bendowski @ gmail.com. ком Польский перевод документации
И Мэтт. Джонстон;
Эта версия справочника описывает и KUser; Версия 1. 0. Эта программа позволяет управлять пользователями и группами вашей системы.
KUser
пользователь
управление
администратор
Инструменты
группа
пароль
Введение
Это краткое введение в & KUser;. Для получения более подробной информации см использования.
В дополнение к конфигурации, чтобы начать использовать и KUser; на самом деле не нужно ничего делать больше.
Когда вы сделали необходимые изменения уже необходимо сохранить. Чтобы сделать это, щелкните значок на панели инструментов или выберите опцию из меню File.
Использование
Главное окно
И KUser; это очень простая программа. В главном окне содержит две вкладки: список пользователей и групп, список. Чтобы изменить настройки для пользователя или группы, просто щелкните по нему дважды, и окно свойств.
Главное окно KUser;
Главное окно KUser;
Свойства пользователя
Диалоговое окно свойств пользователя есть несколько вкладок.
Число вкладок зависит от типа хранения пользователя, и было ли система установить пределы. Дополнительные вкладки будут отображаться, если система использует пароли, скрытые (тени) или аналогичные решения, например, / и т.д. / мастера. PASSWD в BSD.
Вкладка Сведения о пользователе
На вкладке Сведения о пользователе, вы можете изменить:
ID пользователя (UID)
Полное имя
Оболочки по умолчанию (см список покрытий загружается из файла / и т.д. / оболочек)
Домашний каталог
Два рабочих мест
Адрес
Пароль
Пароль Tab Управление
Вкладка Управление паролем появляется, если вы используете пароли, скрытые или аналогичное устройство, например, файла / и т.д. / мастера. PASSWD в BSD.
На вкладке информацию о расширенном Вы можете изменить параметры, связанные с улучшенным пользовательским контрольных счетов.
Минимальное количество дней между изменениями пароля
Дней до пароль Номер истекает, если он не был изменен
Количество дней до истечения срока действия пароля, когда пользователь будет предупрежден
Если и когда счет будет отменен, если срок действия пароля истекает
Фактическая дата начала счета истекает
Класс (на BSD системах)
Дата последнего изменения пароля отображается в верхней части диалогового окна.
Вкладка Ограничения
Вкладка Ограничения вы можете увидеть только в том случае, когда есть по крайней мере один раздел с включенной квотой и файл квот настоящее время. Там вы можете изменить все параметры, связанные с квотой пользователя:
Временный предел файлов
Максимальный предел файлов
Ограничения для файлов Время
Временный предел дескрипторов
Максимальный предел дескрипторов
Ограничение по времени иноды
Все эти параметры могут быть изменены для каждой квоте файловая система с поддержкой пользователей. Файловая система может быть изменен с помощью списка файловых систем пределах.
Вкладка Группы
Закладка Группы содержит информацию о членстве пользователя в группах. Группа основной пользователь может быть выбран из основной группы. Пользователь может быть назначен другой группе путем выбора их в большом окне.
Свойства группы
Диалог Свойства группы содержит список всех пользователей. Отметьте для каждого пользователя, чтобы назначить его в выбранную группу.
Добавить, редактировать и удалять пользователей и группы
Чтобы добавить пользователя или группы, выберите Добавить из Пользователем или группу меню, или нажмите соответствующую кнопку Добавить на панели инструментов. Выбранный пользователь или группа могут быть удалены или изменены таким же образом.
Конфигурация и KUser программа;
Изменение создание пользователя по умолчанию
Чтобы изменить значения по умолчанию, используемые при создании новых пользователей, вы можете использовать диалоговое окно Изменить значение по умолчанию, доступ к которой в меню Настройки, Настройка: & KUser;. Вы можете изменить значения по умолчанию, используемые при создании новых пользователей: интерпретатор и начальный каталог (или раздел с домашними каталогами). Вы можете решить, следует ли создавать домашний каталог или нет, и стоит ли скопировать новые стандартные файлы конфигурации домашний каталог (каркас). Вы также можете включить Личные механизм группу, которая создает свои собственные одним человеком группу для каждого нового пользователя, и удаляет его, когда пользователь будет удален.
Скелет файлы для новых пользователей может быть задан на вкладке Source.
Авторские права и лицензия
И KUser;
Программа Copyright: Copyright 1997- 2000 Денис Першин DYP @ inetlab. ком
Документация Copyright: Copyright 1997- 2000 Денис Першин DYP @ inetlab. ком
Документация Copyright (C) 2000 и Мэтт. Джонстон; И Мэтт. Джонстон. почта;
Польский Перевод документации: Майкл Bendowski Bendowski @ gmail.com. ком
И UnderFDL; И UnderGPL;
Руководство и дельфин;
Петр Penz
питер. Penz @ GMX. на
Орвилл Беннетт
И Орвилл. Беннетт. почта;
Майкл Остин
tuxedup @ пользователей. SourceForge. чистый
Дэвид Edmundson
KDE @ davidedmundson. CO. Великобритания
Алан Blanchflower
Фрэнк Reininghaus
Петр Penz
И Орвилл. Беннетт;
Майкл Остин
И Dolphin знаменатель; является менеджером файлов по умолчанию для & KDE;, предназначенный в первую очередь для полезности.
KDE
Дельфин
Файловый менеджер
файл
управление
Введение
И Dolphin знаменатель; является менеджером файлов по умолчанию для & KDE;, направленных на повышение уровня юзабилити интерфейса пользователя. И Dolphin знаменатель; фокусируется на менеджера функция файла в то время как и Konqueror;, который был менеджером файлов по умолчанию в & KDE; 3 и все еще может быть использован для этой цели является универсальная программа для просмотра различные типы файлов.
Любые ошибки, пожалуйста, сообщите автору и дельфина; через диалог отчета ошибка. Это доступный из Помощь Сообщить об ошибке ... меню.
Обслуживание и дельфин;
Пользовательский интерфейс и дельфин;
Скриншот появления по умолчанию пользовательского интерфейса и дельфина;
Скриншот появления по умолчанию пользовательского интерфейса и дельфина;.
Workspace и дельфин;
Скриншот панели инструментов и дельфин;
Внешний вид рабочей области и дельфин;
Колонны вид позволяет просмотреть количество уровней каталогов в одном окне. При нажатии любой подкаталог на правой стороне есть новый столбец, который содержит элементы этой папке.
Панели
И Dolphin знаменатель; позволяет разместить несколько панелей в рабочем пространстве. Вы можете включить его в панелях меню Вид. Панели могут быть перемещены в разных местах окна и дельфина; нажав на название панели и удерживайте левую кнопку мыши при перемещении.
Мест
Панель мест по умолчанию находится на левом краю окна и показывает сохраненную позицию. Он также показывает все диски и носители, подключенные к компьютеру.
Информация
Информационная панель показывает расширенную информацию о выбранном файле / файлов, включая размер, тип и дату последнего изменения. Эта панель большой предварительный просмотр выбранного файла, а также с возможностью добавления оценки, теги и комментарии.
Каталоги
Панель Каталоги показывает дерево файловой системы. Тем не менее, он отображает только каталоги. При нажатии на левую кнопку мыши на каталоге будет отображаться его содержимое в рабочей области и дельфина;.
Терминал
Панель, содержащая терминал. Терминал будет открыт в каталоге в настоящее время представлены в & дельфина;. Перейдите в директорию, & дельфинов; будет изменить рабочий каталог в терминале, но и изменить каталог, в терминале не изменит каталог & дельфина;. Терминал работает только на локальных дисках.
Советы
Ниже несколько советов, которые будут вам сэкономить время при обращении и дельфина;.
Быстрое добавление в закладки
Поиск файлов
Монтаж устройств хранения данных
Аннулировать
Переименование группы файлов
Сравнивая файлы
Фильтрация файлов
Настройка и дельфин;
Окно и дельфин Настройки;
Навигация
File1,
File2.
Строка меню в основной и дельфина;
Как получить и дельфин;
Ян Schaumann jschauma @ netmeister. организация
8 апреля 2003
kappfinder
1
Установленная программа, которая добавляет к и KDE;.
kappfinder - DIR каталог KDE Общие опции Qt Опции Общие
Описание
КАНАЛЫ Seeker KDE (kappfinder;), пытаясь найти различные программы, установленные в вашей системе от разных производителей и для других сред, а затем добавляет их в систему меню KDE.
Параметры
- Каталог Dir
Устанавливает файлы. Обои для рабочего в указанный каталог
Смотрите также
Подробная документация доступна на помощь: / kappfinder (либо ввести этот адрес в & Konqueror или введите KHelpCenter помощь: / kappfinder).
Авторов
Программа и kappfinder; была написана и Матфия. Hoelzer Kluepfel; И Маттиас. Hoelzer Kluepfel. почта;
Это руководство было подготовлено человеком Джон Schaumann »и jschauma @ netmeister. орг для проекта потерял страницах человека (HTTP:... // WWW netmeister орг / разное / m2p2 / индекс HTML.
Руководство и KFind;
И Дирк. Doerflinger; И Дирк. Doerflinger. почта;
Пол Dabek pdabek @ разовые. PL Польский перевод
И Дирк. Doerflinger;
Программа и KFind; это поисковая система для файлов и KDE;.
KDE
Kdeutils
KFind
Разместить
поиск
Введение
Программа и KFind; это поисковая система для файлов и KDE;.
Начиная & KFind;
Программа и KFind; является полезным инструментом для поиска компьютера для конкретных файлов или файлов, которые соответствуют шаблону. Примером может быть поиск файлов определенного типа или с определенными буквами в имени. Вы можете запустить этот инструмент, нажав на Поиск файлов.
Поиск файлов
Имя / Расположение
Когда вы начинаете & KFind; представляется вполне простое окно. Введите имя искомого слова в текстовом окне Имя:. Выберите папку, в которой вы хотите найти, введя его название в поиск в: или, нажав кнопку Обзор ... и нажмите Enter или Поиск. Если вложенные проверяется, будут найдены все подкаталоги в выбранной папке. Результат отображается в окне ниже.
Вы можете использовать следующие символы:
Звездочка *
Звездочка означает любое число пропущенных символов (даже ноль символов), что означает, что если вы входите, например, поиск. Марк * может найти выжимок файлы, Марк. PNG и marc_ must_ not_ read_ это. KWD. Когда вы входите марта *. KWD то мы можем получить на рынке. KWD и marc_ must_ not_ read_ это. KWD.
Вопросительный знак?
В отличие от звездочкой, вопросительный знак стоит ровно один символ, так что испортить? найдете выжимок, но Марк? ничего не нашли, так как наши файлы называются Марк и Марк. PNG. Вы можете использовать любое количество вопросительных знаков в шаблоне. Сложные слово будет иметь такое же количество символов, как вошел рисунком.
При поиске можно комбинировать два подстановочных знаков.
Закладка Содержание
Тип файла
Здесь вы можете указать тип файла для поиска.
Содержит текст
Введите слово или фразу, которые должны быть включены в поиск файлов. Примечание: если вы делаете это в большой папке или проверить Включая вложенные папки на имя каталога /, то это может занять некоторое время.
Эта опция не будет работать в случае некоторых из файлов, перечисленных в списке Тип файла. Поддерживаются только следующие типы файлов:
Текстовые файлы, например. Исходный код и README файлы
И Kword; И Gt; = 1, 2
И KPresenter; И Gt; = 1, 2
И KSpread; И Gt; = 1, 2
OpenOffice. орг Писатель
OpenOffice. орг Impress
OpenOffice. орг Calc
С индивидуальной прописных и строчных букв
Если вы выбираете эту опцию, программа & KFind; только найти файлы с также в размере букв, например. MARC будет соответствовать только Марк, не Марк.
Regular Expression
Если вы установили инструмент & kregexpeditor; Kdeutils пакет, вы будете иметь дополнительную возможность. Включение это позволит вам искать с помощью регулярных выражений. Регулярное выражение способ указать условий поиска, которые могут быть как сложным и эффективным. Если вы не знакомы с регулярными выражениями, вы можете выбрать Изменить регулярных выражений, чтобы открыть и kregexpeditor;. Этот инструмент позволит вам создавать наборы условий графически и затем генерирует выражение для Вас.
Программа и kregexpeditor; является очень полезным инструментом, который может быть использован в других, чем и KFind; И KDE;. Для получения более подробной информации, обратитесь к файлу справки.
Вкладка Свойства
Здесь Вы можете фильтровать результаты поиска. Выбор особые фильтры:
Найти все файлы, созданные или измененные
Здесь Вы можете ввести две даты, между которыми были созданы файлы и указать период времени.
Размер файла:
Здесь вы можете указать минимальный или максимальный размер файла.
Он принадлежит пользователю: / Он относится к группе:
Здесь вы можете указать имя пользователя и группу.
Авторские права и лицензия
И KFind;
Авторское право:
Разработчиков
Мартин Хартиг
И Стефан. Kulow; И Стефан. Kulow. почта;
И Марио. Weilguni; И Марио. Weilguni. почта;
И Алекс. Сепеда; jazepeda @ PacBell. чистый
Мирослав Flídr Flídr @ KKY. ZCU. CZ
И Харри. Porten; И Харри. Porten. почта;
Дима Рогозин Дима @ ртуть. CO. Иллинойс
И Карстен. Пфайффер; И Карстен. Пфайффер. почта;
Ханс Петтер Bieker Bieker @ KDE. организация
И Вальдо. Бастиан; И Вальдо. Бастиан. почта;
Документация Copyright & копия; 2001 и Дирк. Doerflinger; И Дирк. Doerflinger. почта;
Польский перевод: Павел Dabek pdabek @ разовые. ан
И UnderFDL; И UnderBSDLicense;
Установка
Как получить и KFind;
И Установить. Введение. документации;
Потребности
Для того, чтобы успешно использовать и KFind; Вы должны и KDE; 4. X.
Компиляция и установка
И Установить. собрать. документации;
Руководство пользователя KDE
И Лаури. Вт; И Лаури. Вт. почта;
7 июня 2005: K Desktop Environment
KFind
1
поиск файлов инструмент для & KDE;
KFind ścieżka_ поиск KDE Общие опции Qt Параметры Generic
Описание
Поиск файлов инструмент позволяет искать заданные пользователем файлов на диске, или файлы, соответствующие определенному шаблону. Например, поиск файлов определенного типа файлов, содержащих определенные буквы в названии или части текста в содержании.
Программа и KFind; это графический инструмент, и, как правило, не запускается из командной строки.
Параметры
Поиск ścieżka_
Это можно сделать ряд путей, разделенных точкой с запятой. Это может быть использован для создания иконок на рабочем столе или на панели быстрого поиска в разных местах.
Опции в виде списка переменных
Смотрите также
Подробная документация пользователя доступно от помощи: / KFind (либо ввести этот адрес в & Konqueror; или запустить KHelpCenter помощь: / KFind).
Авторов
Нынешний сопровождающий и KFind; есть. Список авторов доступен в руководстве в KHelpCenter.
Этот документ был подготовлен по: & Лаури. Вт; И Лаури. Вт. почта;
И Инфоцентр;
Майкл Макбрайд
И Майк. Макбрайд. почта;
Marcin Bokszczanin mboksz @ bcig. ан Польский Перевод Marcin Коцур marcinkocur @ Op. р Польский перевод
Этот документ описывает информационный центр & KDE;.
KDE
kinfocenter
система
информация
модуль
И Инфоцентр; (Или просто информационный центр) является инструментом для удобного просмотра вашего и KDE; и система.
Информационный центр состоит из различных модулей. Каждый отдельная программа, информационный центр организует все эти программы в одном месте.
Использование и Инфо-центр;
Следующий раздел подробно описывает, как использовать модули браузера. Информацию об отдельных модулей можно найти в информационном модулей Центра
Начиная & Инфо-;
И Инфоцентр; может работать в 3 способами:
Выбор меню панели K Информационный центр системы.
Нажатие клавиш Alt; F2 ..
Диалоговое окно Запуск появляется. Введите kinfocenter и нажмите кнопку Пуск или нажмите & Enter;.
Вы также можете ввести kinfocenter и в командной строке.
Все эти методы являются эквивалентными.
Внешний вид и информационный центр;
Информационный центр окно разделено на три части.
В верхней части окна находится строка меню, что дает быстрый доступ к большинству и InfoCenter;. Меню подробно описаны в информационном центре меню и KDE;.
На левой стороне вы увидите список модулей. Принципы перемещения по списку, описаны в разделе навигации между модулями.
Основная часть окна отображается информация о системе.
Меню и информационный центр;
Этот раздел описывает, что каждый из пункта меню.
Меню File
В меню Файл есть только один элемент.
Ctrl; Выход Q файла
Закрывает информационный центр.
Меню Помощь
& Помогите. Меню. документации;
Выход & kinfocenter;
Вы можете оставить информационного центра в 3 способами:
Выбор файла Quit из меню.
Нажатие Ctrl; Q на клавиатуре.
При нажатии на кнопку Закрыть в строке заголовка.
Модули и информационный центр;
Навигация между модулями
Ниже список стандартных модулей конфигурации (сортировка по категориям) в данном пакете kdebase. Пожалуйста, обратите внимание, что это может быть представлено более модулей после установки какого-либо дополнительного программного обеспечения.
Приборы
DMA каналы
Прерывания
Порты ввода / вывода
Память
Сетевые интерфейсы
OpenGL
Разделы
PCI
PCMCIA
Процессор
Протоколы
Samba Статус
SCSI
Звук
USB-устройства
И X-сервер;
Авторские права и лицензия
И Инфоцентр;
(C) 1997 2001 Разработчики Информационный центр
Соавторы:
Маттиас Hoelzer Kluepfel и Маттиас. Hoelzer Kluepfel. почта;
И Маттиас. Элтер; И Маттиас. Элтер. почта;
Документация Copyright 2000 Майкл Макбрайд и Майк. Макбрайд. почта;
И Павел. Кэмпбелл; И Павел. Кэмпбелл. почта;
И Хельге. Deller; И Хельге. Deller. почта;
И Марк. Донохью;
И Патрик. Dowler;
И Дункан. Холдейн; Дункан @ KDE. организация
И Штеффен. Хансен; stefh @ MIP. НУ. DK.
Мартин Джонс и Мартин. Р. Джонс. почта;
И Йост. Шенк; И Йост. Шенк. почта;
И Джонатан. Певица; И Джонатан. Сингер. почта;
И Томас. Tanghus; И Томас. Tanghus. почта;
& Кришну. Tateneni; & Кришну. Tateneni. почта;
Эллис Уайтхед ewhitehe @ UNI Фрайбурга. де
Польский перевод: Marcin Bokszczanin mboksz @ bcig. Ru Проверка и обновление для KDE 3. 5. 4: Marcin Коцур marcinkocur @ Op. ан
И UnderFDL; И UnderGPL;
Информация об устройстве
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
устройство
информационная система
Эта страница отображает информацию об устройствах, имеющихся в системе.
Подробная информация отображается в зависимости от установленной системы. На некоторых системах, информация об устройстве пока не доступна.
И Linux; информация считывается из / Proc / устройств и / Proc / разное, которые доступны только тогда, когда виртуальная / Proc файловая система встроена в ядро. Устройства делятся на группы (характер, блок, и т.д.) устройство основной номер предшествует идентификационной табличке.
Вы не можете изменять настройки на этой странице.
DMA информационный канал
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
DMA
информационная система
Эта страница показывает информацию о канале DMA (прямой доступ к памяти - прямой доступ к памяти). DMA каналы позволяют устройствам прямого доступа к памяти во время передачи данных без использования ресурсов центрального процессора. Как правило, процессоры i386 PC, имеют восемь каналов DMA (0- 7).
Подробная информация отображается в зависимости от установленной системы. На некоторых системах, информация DMA Channel пока не доступна.
W & Linux; информация считывается из / Proc / DMA, который доступен только тогда, когда виртуальная / Proc файловая система встроена в ядро.
Список всех DMA каналов (ISA шина) используются здесь отображается. Первая колонка показывает канал DMA, и второй отображается имя устройства, которое его использует.
Не будет отображаться DMA канал, который не используется,.
Вы не можете изменять настройки на этой странице.
Аппаратное прерывание (IRQ)
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
IRQ
прерывание
информационная система
Прерывание (IRQ)
Эта страница показывает информацию о аппаратных прерываний в использовании и устройств, которые их используют.
IRQ является аппаратная система, используемая в ПК устройствами на шине ISA (таких как клавиатура, модем, звуковая карта, и т.д.;), чтобы отправить сигнал прерывания процессора готов передавать или принимать данные. К сожалению, как правило, PC i386 доступен для шестнадцати IRQ (0- 15), который мы можем сопоставить разные устройства, система использует шину ISA.
Многие проблемы, вызванные аппаратурой IRQ конфликтов, когда два устройства нужно использовать один и тот же IRQ или программа, которая поддерживает устройство настроено на использование другого IRQ, чем это, назначенный устройству.
Подробная информация отображается в зависимости от установленной системы. В некоторых системах, информационных систем IRQ прерывания еще не доступны.
W & Linux; Эта информация считывается из / Proc / прерываний, которая доступна только тогда, когда виртуальная / Proc файловая система встроена в ядро.
Первый столбец номер IRQ. Второй количество прерываний, которые были получены со времени последней загрузки. Третья колонка показывает тип прерывания. Четвертый идентифицирует устройство, возложенные на него.
Вы не можете изменять настройки на этой странице.
Порты ввода / вывода
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
Порты ввода / вывода
Информация о системе
Информация о портах въезда / выезда,
Эта страница показывает информацию о входных / выходных портов.
Порты ввода / вывода адреса памяти, используемые процессором для прямого общения с устройством, которое послал сигнал прерывания.
Обмен командами и данными между процессором и устройством осуществляется по адресу I / O порт устройства. Номер порта хранится в шестнадцатеричном виде. Каждое устройство получает свой собственный порт ввода / вывода. Многие устройства используют более одного адреса, порты ввода / вывода. Мы говорим также ряд шестнадцатеричных чисел.
Подробная информация отображается в зависимости от установленной системы. В некоторых системах, информация о портах въезда / выезда, пока не доступны.
W & Linux; Эта информация считывается из / Proc / ioports, которая доступна только тогда, когда виртуальная / Proc файловая система встроена в ядро. Список портов в системе отображается на экране.
Первый столбец дает портов ввода / вывода (или диапазон портов), вторая идентифицирует устройство, которое использует этот порт.
Вы не можете изменять настройки на этой странице.
Информация о памяти
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
память
информационная система
Этот модуль отображает информацию о количестве используемой памяти в системе. Информация о памяти постоянно обновляется и может быть очень полезным для определения так называемой. Узкие места при запуске программы.
Типы памяти
Сначала вы должны знать, что существует два типа памяти, доступной системы и программ.
Первый тип памяти физической памяти. Эта память, обычно называют RAM (Random Access Memory), чип памяти вставляется в пазы на борту вы приобрели компьютер.
Второй тип памяти виртуальной памяти или замены модуля памяти (вы можете также встретится с названием свопа). Эта часть памяти пространства на диске. Операционная система резервирует место на жестком диске для подкачки. Операционная система может использовать эту виртуальную память (или подкачку), если она заканчивается физической памяти. Это название происходит от того, что операционная система собирает данные от физической памяти, которая, по его мнению на некоторое время не будет использоваться, и хранит их в пространство, зарезервированное. Тогда загружает данные, которые в настоящее время находятся в эксплуатации. Чтение и запись с виртуальной памятью происходит не так быстро, как это физическая память. Таким образом, операционная система пытается сохранить данные (особенно часто используется) в физической памяти.
Общий объем доступной памяти Количество физической и виртуальной памяти.
Информационный модуль памяти
Окно разделено на две секции
В верхней части показывает информацию об общем количестве физической памяти: физической памяти, совместно используемой памяти, и дисковых буферов.
Все четыре значения показывают общее количество байтов и мегабайты (мы можем считать, что 1 мегабайт = чуть более 1 000 000 байт)
Нижняя секция показывает три графика:
Общая память (это сумма физической и виртуальной памяти).
Физическая память
Виртуальная память или замена памяти.
Зеленый памяти доступно / свободно, и красный, что находится в использовании.
Ни одно значение для каждого типа памяти не является критическим и меняется достаточно регулярно. После прочтения этой страницы, старайтесь соблюдать как изменения использования памяти.
Ваш компьютер достаточно свободного пространства (зеленые зоны)? Если нет, то вы можете увеличить объем памяти, добавив дополнительные фишки физической памяти (установка на материнской плате), или увеличить размер свопа.
Если ваш компьютер кажется вялым: Ваш физическая память используется полностью и не кажется ли жесткий диск, чтобы быть в постоянном использовании? Эти данные свидетельствуют о том, что вы не есть соответствующее количество свободной физической памяти, а компьютер пытается восполнить этот пробел с помощью виртуальной памяти (своп). Вы должны, следовательно, увеличить объем оперативной памяти (физической), чтобы увеличить производительность вашего компьютера.
Сетевые интерфейсы
И Лаури. Вт;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
Сеть
Интерфейсы
На этой странице отображается информация о сетевых интерфейсах (обычно НИС), установленных на вашем компьютере.
Подробная информация отображается в зависимости от установленной системы. В некоторых системах, эта информация не может пока отсутствуют.
Вы не можете изменять настройки на этой странице.
OpenGL
Илья Корнийко K_ Илья @ укр. Net
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
OpenGL
информационная система
OpenGL
Эта страница показывает информацию о реализации OpenGL, установленной в системе. OpenGL (для "открытого Graphics Library") не зависит от аппаратной платформы, необходимой для отображения 3D-графики.
GLX является обязательным для OpenGL с X 'с.
DRI (Direct Rendering Инфраструктура) обеспечивает аппаратное ускорение OpenGL. Чтобы эта функция работала правильно, необходимо графическая карта с 3D ускорителем и правильно установленного драйвера.
Для получения более подробной информации, посетите официальный сайт OpenGL HTTP: // WWW. OpenGL. организация
Информация о разделе
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
раздел диска
информационная система
На этой странице содержится информация о разделе жестких дисков.
Подробная информация отображается в зависимости от установленной системы. В некоторых системах, информация раздел еще не доступен.
W & Linux; Эта информация считывается из / Proc / разделов, которые доступны только тогда, когда виртуальная / Proc файловая система составлена ​​в ядро ​​системы (2. 1 х или более поздней).
Первая колонка показывает имя устройства системный блок, второй показывает место, где вы можете прочитать данные с устройства (точки монтирования), третий определяет тип файловой системы на устройстве, четвертый показывает общий объем данных, который способен хранить устройство. Бесплатный колонна является общая емкость устройства без уже хранится на данных. Последняя колонка показывает конкретного устройства опции монтирования.
Вы не можете изменять настройки на этой странице.
Установленная система шины PCI и PCI карты
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
PCI
информационная система
На этой странице отображается информация о PCI, PCI карт и других устройств, использующих PCI (межсоединений периферийных компонентов).
Подробная информация отображается в зависимости от установленной системы. В некоторых системах, информация шины PCI пока не доступна.
W & Linux; Эта информация считывается из / Proc / PCI которая доступна только тогда, когда виртуальная / Proc файловая система встроена в ядро. Список всех устройств PCI, найденных во время инициализации ядра, а их конфигурации.
Каждая запись начинается с автобусом, устройства и номера функции.
Вы не можете изменять настройки на этой странице.
PCMCIA
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
Портативный компьютер
PCMCIA
Этот модуль отображает информацию о PCMCIA-карт.
Подробная информация отображается в зависимости от установленной системы. В большинстве систем, нет информация отображается.
Информация о процессоре
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
ЦПУ
процессор
информационная система
На этой странице отображается информация о процессоре (CPU - Central Processing Unit).
Подробная информация отображается в зависимости от установленной системы. На некоторых системах, устройство обработки информации пока не имеется.
W & Linux; Информация извлекается из файла / Proc / CPUInfo, которая доступна только тогда, когда виртуальная / Proc файловая система встроена в ядро.
Информация, отображаемая в окне, зависят от версии и типа процессора, установленного на вашем компьютере. Окно содержит два столбца. Первая содержит имя параметра, второй величины.
Вы не можете изменять настройки на этой странице.
Протоколы
И Лаури. Вт;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
Протоколы
Протоколы пробку (IOSlaves)
В верхней части окна вы можете увидеть выпадающий список доступных плагинов протоколов (IOSlaves), которые установлены на вашей системе. KIOslave определить, как и KDE; общаться с другими компьютерами, других программ или какие виды деятельности должны осуществляться с файлами.
После выбора имени протокола плагина из выпадающего списка, вы получите информацию о нем, включая описание использования.
Этот модуль пока еще носит чисто информационный характер. Вы не можете делать какие-либо изменения в нем.
Информация о статусе Samba
И Александр. Neundorf;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
KControl
Самба
информационная система
Status Monitor Samba и NFS является графический интерфейс для интересов smbstatus и showmount. Smbstatus учитывая текущие соединения через Samba, и является частью инструментов Samba, которая реализует протокол SMB (Session Message Block) протокол, называемый также NetBIOS или LanManager.
Этот протокол может быть использован для ustępniania ресурс жестких дисков и принтеров в сетевом окружении, в том числе сети на основе различных версий и Microsoft; И Windows;.
Showmount является частью NFS. Относится к файловой системе NFS сети и традиционные протокола сети разделения ресурсов и UNIX;. В этом случае выход показывает вывод команды showmount - в локальный. На некоторых системах showmount в / USR / SBIN, проверьте путь к showmount в переменной PATH окружающей среды.
Общий
На этой странице вы можете увидеть список текущих подключений к общим ресурсам через SMB или NFS. Первая колонка показывает, какой протокол вы используете ресурсы вашего компьютера, обеспечивая: Samba (SMB) или NFS. Вторая колонка показывает имя общего ресурса, третье имя подключенного компьютера. Колонка описано актуальны только в том случае акций Samba.
Четвертая колонка содержит идентификатор пользователя, который использует общий ресурс. Обратите внимание, что идентификатор не обязательно совпадает с ID пользователя и UNIX;. То же самое относится к следующей колонке, которая выводит на экран пользователя в идентификатор группы.
Каждое подключение к ресурсу подается одним процессом (Smbd), следующая колонка показывает количество (PID) Smbd. Если вы закроете процесс, ответственный за обработку подключение к ресурсу пользователя, подключение будет прервано. Если в процессе подключения, работающих удаленно и Windows; будут закрыты, но он также создал новое событие, чтобы закрыть старый процесс будет идти для него незамеченным.
Последняя колонка показывает, сколько файлов теперь открыт подключенного пользователя. Пожалуйста, обратите внимание, что эта информация относится к числу открытых в данный момент файлов, а не копируются ранее открытыми, и т.д.;
Установленная
На этой вкладке вы можете узнать, какие были установлены ресурсов и NFSA Samba (преобразуются) с другого компьютера в вашей локальной файловой системе. Первая колонка показывает тип участия: Samba или NFS. Второй показывает имя общего и фамилию, под которым установлен (преобразуются) участие.
Устанавливается NFS акций вы должны увидеть и Linux; (Проверен) или в системе & Solaris; (Этот случай не был проверен).
Ежедневно
На этой вкладке есть удобный способ содержимого файлов журналов самба. Список отображает содержимое журнала будет пустым, пока вы не нажмете кнопку Update. Убедитесь, что местоположение файла журнала Samba согласуется с тем, что указано в файле журнала Samba. Если вы измените имя файла журнала, нажмите кнопку Обновить.
События самба лог-файлов зависит от параметра LogLevel в файле конфигурации (смотрите файл / и т.д. / Samba / л. Conf). Если параметр LogLevel = 1, самба сохраняет информацию о созданных и закрытых подключений. Если этот параметр установлен в 2, дополнительно письменную информацию, касающуюся открытые и закрытые файлы. Если значение больше, чем 2, запись имени субъекта компьютеров, подключенных к / пользователей.
Если вы заинтересованы в присоединении в том, кто и какие файлы были открыты, вы должны установить параметр LogLevel = 2 и регулярно создавать новый файл журнала Samba. (Например, набора в хрон работу, которая раз в неделю проходит текущий файл журнала Samba в другой каталог и создает новый пустой файл. В другом случае, файл журнала может достигать очень больших размеров и, что мешает ее просмотра.
Установив флажок ниже, вы можете решить, что события, записанные в файле журнала, которая будет отображаться в списке. При выборе любого поля, вы должны нажать на кнопку Update для отображения результатов. Тем не менее, если параметр LogLevel имеет меньшее значение, чем привело бы от выбранного варианта, никаких результатов не будет отображаться.
При нажатии на заголовке столбца, можно отсортировать данные в списке.
Статистика
В этой вкладке вы можете фильтровать содержимое по своему содержанию.
Давайте предположим, что список выбора события (ниже списка) установлен в связи, то служба / файла устанавливается * и Host / User установлена ​​в *, и Показать расширенную информацию о и показать расширенную информацию о компьютере не установлен.
После нажатия на кнопку Update вы увидите, как часто подключение к любому (*) услуг / файла любым (*) компьютера / пользователя. Теперь включите Показать расширенную информацию о вашем компьютере, а затем нажмите Обновить. Давайте теперь посмотрим, сколько соединений было открыто по имени компьютера содержит символы * (или любой).
Теперь нажмите Очистить результатов.
Теперь установите в поле Event получить доступ к файлу и позволит Показать расширенную информацию о. Затем нажмите кнопку Update.
Теперь мы видим, как часто обращались для каждого файла в общем ресурсе. Если вы включите Показать расширенную информацию о вашем компьютере, вы увидите, как часто каждый пользователь открыл каждый файл.
В службе / файл и хост / пользователь, вы можете использовать специальные символы * и? Аналогичным образом, как в консоли. Пожалуйста, обратите внимание, что регулярные выражения не распознаются.
При нажатии на заголовке столбца, можно отсортировать список в плане содержания этой колонке. Таким образом, вы можете узнать, какие файлы часто и с помощью которого пользователь открыл.
Авторов
Авторские права на модуль: Copyright 2000 Майкл Glauche и & Александр. Neundorf; И Александр. Neundorf. почта;
Первоначально написанный по: Майкл Glauche
В настоящее время под управлением: & Александр. Neundorf; И Александр. Neundorf. почта;
Авторы
Переход на KControl апплет:
И Маттиас. Hoelzer Kluepfel; И Маттиас. Hoelzer Kluepfel. почта;
Использование K3Process вместо POPEN, дальнейшей коррекции ошибок:
И Дэвид. Фор; И Дэвид. Фор. почта;
Переход на kcmodule, добавил Tab 2, 3, 4, исправление ошибок:
И Александр. Neundorf; И Александр. Neundorf. почта;
Документация (C) 2000 и Александр. Neundorf; И Александр. Neundorf. почта;
Преобразование документация DocBook: & Mike. Макбрайд; И Майк. Макбрайд. почта;
Перевод: Mandriva офис по Mandriva. Ru Проверка и обновление для KDE 3. 5. 4: Marcin Коцур marcinkocur @ Op. ан
Информация SCSI
И Маттиас. Hoelzer Kluepfel;
И Хельге. Deller;
И Дункан. Холдейн;
И Майк. Макбрайд;
(C) 2005 Mandriva офис по Mandriva. ан Польский Перевод Marcin Коцур marcinkocur @ Op. Ru Проверка и обновление для KDE 3. 5. 4
KDE
